{
  "high_level":{
    "device":{
      "base_part_number":"RC76xx",
      "device_type":"COMMUNICATION_OTHER",
      "manufacturer":"Semtech",
      "packages":[
        "LGA 239-pad"
      ],
      "part_numbers":{
        "RC7611":{},
        "RC7611-1":{},
        "RC7612":{},
        "RC7612-1":{},
        "RC7620":{},
        "RC7620-1":{},
        "RC7630":{},
        "RC7630-1":{},
        "RC7630J":{}
      },
      "serial_busses":[
        "UART",
        "SPI",
        "I2C"
      ]
    }
  },
  "pins":{
    "ADC0":{
      "description":"Analog to Digital Converter",
      "direction":"INPUT",
      "group":"ADC",
      "if_unused":"Leave open or Ground",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External Sensor or Analog Signal Source",
            "connection_details":"The analog output of the sensor or signal source should be connected to the ADC0 pin.",
            "purpose":"To provide an analog voltage signal for the module to convert into a digital value."
          },
          {
            "component_name":"Ground",
            "connection_details":"If the analog input is not in use, the ADC0 pin can be connected to ground.",
            "purpose":"To ensure a defined low state for the analog input when not in use."
          }
        ],
        "connectivity":"The ADC0 pin should be connected to the analog output of an external sensor or an analog signal source. It should also be connected to ground if the analog input is not being used, or left open if not needed. The pin is an analog input to the module.",
        "detailed_description":"ADC0 is an analog-to-digital converter input pin on the Semtech RC76xx module. It is used to convert analog signals into digital values that can be processed by the module's internal circuitry. The ADC allows the module to interface with external analog sensors or components that generate analog voltage signals.",
        "functionality":"The pin serves as an analog input for the Analog to Digital Converter. It is used to measure external analog voltages, which can then be converted into digital values by the module. This functionality is essential for integrating analog sensors or other analog signal sources with the RC76xx module.",
        "precautions":"The full-scale voltage level for ADC0 is between 0.1V and 1.7V. Applying voltages outside this range may damage the module. Ensure that the signal source is properly interfaced with the module's voltage levels. Additionally, it is recommended to leave the pin open if it is not being used to avoid any potential interference or unintended behavior."
      },
      "name":"ADC0",
      "pin_id":"25",
      "type":"ANALOG"
    },
    "ADC1":{
      "description":"Analog to Digital Converter",
      "direction":"INPUT",
      "group":"ADC",
      "if_unused":"Leave open or Ground",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Analog Signal Source",
            "description":"This is the external source that provides the analog voltage to be measured. This could be a sensor, a voltage divider, or any other analog signal generator."
          },
          {
            "component_name":"Resistor (optional)",
            "description":"A resistor can be used in series with the analog signal source for current limiting or signal conditioning if necessary, although not strictly required by the datasheet."
          },
          {
            "component_name":"Capacitor (optional)",
            "description":"A small capacitor (e.g., 0.1 uF) can be placed in parallel with the ADC1 pin to ground for noise filtering, as is common practice for analog inputs."
          }
        ],
        "connectivity":"The ADC1 pin should be connected to an analog signal source that needs to be measured by the module.  It can be left open or connected to ground if not used.",
        "detailed_description":"The ADC1 pin is an analog input pin for the Analog to Digital Converter (ADC) interface on the Semtech RC76xx module. The module provides two general purpose ADC inputs, ADC1 and ADC0.",
        "functionality":"This pin is dedicated to analog-to-digital conversion. It takes an analog voltage input and converts it into a digital value that can be read by the module's processing core.",
        "precautions":[
          "The analog input voltage to ADC1 must remain within the specified full-scale range of 0.1V to 1.7V. Exceeding this range can lead to inaccurate readings or potential damage.",
          "The ADC1 pin should not be connected to any digital signals or power supply rails.",
          "If the pin is not used, it is recommended to leave it open or connect it to ground to avoid floating input issues. However, if connected to ground, ensure it does not interfere with other ground connections.",
          "Ensure proper PCB layout practices are followed to minimize noise coupling to the ADC1 pin, as this can affect the accuracy of the analog-to-digital conversion."
        ]
      },
      "name":"ADC1",
      "pin_id":"24",
      "type":"ANALOG"
    },
    "ANT_CNTL0":{
      "description":"Antenna\ncontrol",
      "direction":"OUTPUT",
      "group":"Antenna\ncontrol",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"The primary component to be connected to ANT_CNTL0 is the control input of a tunable antenna or an associated switching component. The specific type of component depends on the antenna design. The exact implementation details will be specific to the tunable antenna system being integrated.",
        "connectivity":"This pin should be connected to the control input of an external tunable antenna system or switch. If not used, it should be left unconnected.",
        "detailed_description":"ANT_CNTL0 is an output signal provided by the Semtech RC76xx module that can be used for host designs incorporating tunable antennas. Specifically, it can be used for customer-defined external switch control for tunable antennas.",
        "functionality":"This pin can be configured for use as a GPIO using the AT+WIOCFG command. It is also used in conjunction with other ANT_CNTL pins (ANT_CNTL1, ANT_CNTL2, ANT_CNTL3) and AT commands like AT!CUSTOM=\"BANDSELEN\",1 and AT!ANTSEL=<band>,<gpio1>,<gpio2>,<gpio3>[,<gpio4>] to tune antennas for specific bands.",
        "precautions":"Host support for antenna control signals is optional. The timing of these signals is not guaranteed by Semtech. Developers should verify the performance of tunable antennas using these signals. If the pin is not used, it should be left unconnected."
      },
      "name":"ANT_CNTL0",
      "pin_id":"153",
      "type":"DIGITAL"
    },
    "ANT_CNTL1":{
      "description":"Antenna\ncontrol",
      "direction":"OUTPUT",
      "group":"Antenna\ncontrol",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Tunable Antenna Switching Circuit",
            "details":"This is an external component or circuit integrated into the host device's antenna system. It receives control signals from the RC76xx module (specifically ANT_CNTL0, ANT_CNTL1, ANT_CNTL2, ANT_CNTL3) to adjust the antenna's operating parameters, such as frequency range or impedance matching. The specific type of switching circuit will depend on the antenna design, but it typically involves an electronic switch (e.g., PIN diodes, FETs) controlled by digital signals."
          }
        ],
        "connectivity":"The ANT_CNTL1 pin should be connected to the control input of an external tunable antenna's switching circuit. This connection allows the RC76xx module to actively manage the antenna's configuration.",
        "detailed_description":"ANT_CNTL1 is an output signal provided by the Semtech RC76xx module that can be used for host designs incorporating tunable antennas. Its specific purpose is to control external switching mechanisms for these tunable antennas.",
        "functionality":"The ANT_CNTL1 pin serves as a control signal for external tunable antennas. Its functionality is primarily to enable antenna tuning, which is often necessary for specific band operations or to optimize performance based on network conditions. The specific behavior of this pin (e.g., whether it's actively driven or can be reconfigured) is dependent on the firmware configuration and AT commands used to manage antenna settings.",
        "precautions":[
          "The support for antenna control signals is optional and may be firmware-dependent. Ensure that the specific firmware version loaded onto the module supports the use of these pins for antenna control.",
          "If the ANT_CNTL1 pin is not used, it should be left unconnected ('Leave open') to ensure compatibility with other Semtech CF3 modules and to prevent potential issues.",
          "The AT command AT!CUSTOM=\"BANDSELEN\",1 must be enabled for band selection to be active, which is required for tuning the antennas. This setting is persistent unless explicitly disabled.",
          "The specific mapping of ANT_CNTL signals to antenna tuning parameters is configured via the AT!ANTSEL command, which takes parameters corresponding to <band>, <gpio1>, <gpio2>, <gpio3>, and optionally <gpio4>. Ensure correct configuration to utilize ANT_CNTL1 for the intended tuning function."
        ]
      },
      "name":"ANT_CNTL1",
      "pin_id":"154",
      "type":"DIGITAL"
    },
    "ANT_CNTL2":{
      "description":"Antenna control",
      "direction":"OUTPUT",
      "group":"Antenna\ncontrol",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"The ANT_CNTL2 pin is typically connected to the control input of an external antenna tuner or a switching component within the antenna system. The specific component would be an electronic switch or a digital potentiometer designed to adjust the antenna's characteristics based on control signals. If used as a GPIO, it would connect to the input of a microcontroller or another digital logic input.",
        "connectivity":"ANT_CNTL2 should be connected to the control input of a tunable antenna's switching circuitry or to a GPIO input of another device if used as a GPIO. The signal is an output from the module.",
        "detailed_description":"ANT_CNTL2 is an output signal provided by the Semtech RC76xx module. It is part of a set of four such signals (ANT_CNTL0, ANT_CNTL1, ANT_CNTL2, ANT_CNTL3) intended for host designs that incorporate tunable antennas. These signals can be used to control the antenna's tuning for specific bands, assisting with features like neighbor cell measurements and inter-RAT handovers. The module's support for these antenna control signals is optional.",
        "functionality":"The primary function of ANT_CNTL2 is to act as a customer-defined external switch control for tunable antennas. Its specific behavior (high or low state) is determined by the band the module is operating on, configured via AT commands. It can also be configured for use as a General Purpose Input/Output (GPIO) using the AT+WIOCFG command.",
        "precautions":"The timing of the ANT_CNTL2 signal is not guaranteed by Semtech; developers must evaluate its performance in their specific application. Support for these signals is optional, meaning not all module variants may implement them. If the AT+WIOCFG command is used to configure this pin as a GPIO, it will no longer function as an antenna control signal. Developers should consult the RC76xx AT Command Reference for specific commands related to antenna control and GPIO configuration."
      },
      "name":"ANT_CNTL2",
      "pin_id":"155",
      "type":"DIGITAL"
    },
    "ANT_CNTL3":{
      "description":"Antenna control",
      "direction":"OUTPUT",
      "group":"Antenna\ncontrol",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_description":"An external tunable antenna that requires control signals for adjusting its operating characteristics. The specific implementation will depend on the antenna's design and the desired tuning parameters.",
            "component_name":"Tunable Antenna System"
          },
          {
            "component_description":"Other external components or systems that can be controlled by a digital output signal from the module.",
            "component_name":"External Circuitry"
          }
        ],
        "connectivity":"This pin should be connected to the control input of an external tunable antenna system or other external circuitry as determined by the antenna manufacturer's recommendations or specific application requirements.",
        "detailed_description":"ANT_CNTL3 is an output signal from the Semtech RC76xx module that can be used for controlling tunable antennas.",
        "functionality":"This pin can be configured for use as a GPIO using the AT+WIOCFG command. When used for antenna control, it supports the AT!ANTSEL command to tune the antenna for specific bands by driving the signal high or low.",
        "precautions":[
          "Antenna control signals support is optional and depends on firmware configuration.",
          "When used for antenna control, the pin's functionality is determined by AT commands, specifically AT!ANTSEL.",
          "Developers are responsible for evaluating the performance of tunable antennas that use these signals.",
          "Semtech does not guarantee the timing of the ANT_CNTLx signals.",
          "If the pin is not used for antenna control or as a GPIO, it should be left unconnected ('Leave open').",
          "Ensure that the pin is not driven to a logic high level if it's intended to be used for other control purposes where a low level is active."
        ]
      },
      "name":"ANT_CNTL3",
      "pin_id":"156",
      "type":"DIGITAL"
    },
    "DR_SYNC":{
      "description":"GPS dead reckoning\nsync signal",
      "direction":"OUTPUT",
      "group":"GPS",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Device",
            "connection_description":"The DR_SYNC output from the module should be connected to a corresponding input or synchronization logic on the host device. This connection allows the host to utilize the precise timing information provided by the GPS for dead reckoning calculations."
          }
        ],
        "connectivity":"The DR_SYNC signal is an output from the module. It should be connected to a host device that requires GPS synchronization signals for dead reckoning functionality.",
        "detailed_description":"The DR_SYNC pin is an output signal used for GPS dead reckoning synchronization. The module pulses this signal once every integer GPS second. When position fixes are occurring, the DR_SYNC pulse is aligned precisely with the GPS time. When a position fix cannot be made (e.g., in a tunnel), the module continues to pulse the DR_SYNC signal every second as long as the uncertainty of the GPS time is low. When the uncertainty level becomes high, the module stops pulsing the signal.",
        "functionality":"The pin functions as a GPS dead reckoning synchronization signal. It pulses once every GPS second, aligned with GPS time when fixes are available. When fixes are not available but GPS time uncertainty is low, it continues to pulse. If GPS time uncertainty is high, the pulsing stops.",
        "precautions":[
          "The pin has an internal pull-down when the module boots or resets.",
          "The DR_SYNC signal's availability and stability are dependent on the GPS receiver's ability to acquire and maintain a position fix. In environments with poor GPS reception, the signal may become unstable or cease altogether.",
          "The host device should be designed to handle potential variations or absence of the DR_SYNC signal if operating in GPS-denied environments."
        ]
      },
      "name":"DR_SYNC",
      "pin_id":"42",
      "type":"DIGITAL"
    },
    "EXT_GPS_LNA_EN":{
      "description":"External GNSS LNA\nenable",
      "direction":"OUTPUT",
      "group":"GPS",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External GNSS Low Noise Amplifier (LNA)",
            "connection_details":"The EXT_GPS_LNA_EN pin should be connected to the enable/control pin of the external GNSS LNA. The specific pin will vary depending on the LNA component chosen."
          }
        ],
        "connectivity":"This pin should be connected to the enable or control input of an external GNSS LNA component. The signal should be routed to the appropriate pin on the LNA that activates its amplification circuitry.",
        "detailed_description":"EXT_GPS_LNA_EN is an output signal from the Semtech RC76xx module that controls an external Low Noise Amplifier (LNA) for the Global Navigation Satellite System (GNSS) receiver. When the GNSS functionality is active and requires the external LNA to be enabled, this pin will drive high. This allows the host device to manage the power to the external LNA, optimizing power consumption when GNSS is not in use.",
        "functionality":"The primary function of EXT_GPS_LNA_EN is to enable or disable an external GNSS LNA. It drives high when the GNSS receiver is active and requires amplification. It is typically driven low or left open when GNSS is inactive, thus powering down the external LNA.",
        "precautions":[
          "Ensure the external LNA is compatible with the 1.8V logic level output of the EXT_GPS_LNA_EN pin.",
          "If the external LNA is not used, this pin should be left unconnected (open).",
          "The default state of the pin when the module boots or resets is 'H' (High), indicating the LNA is enabled by default. This behavior may need to be managed in the host application's power sequencing.",
          "Verify that the chosen external LNA does not draw excessive current when enabled by this signal, as it is an output pin with limited current drive capability."
        ]
      },
      "name":"EXT_GPS_LNA_EN",
      "pin_id":"43",
      "type":"DIGITAL"
    },
    "Ext_SIM_switch":{
      "description":"External SIM switch",
      "direction":"OUTPUT",
      "group":"O",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External SIM Switch IC",
            "description":"A component that allows selection between multiple SIM cards, controlled by the Ext_SIM_switch pin. Examples include FSA2567MPX."
          },
          {
            "component_name":"External circuitry",
            "description":"For GPIO functionality, it connects to external components as per the application's needs."
          },
          {
            "component_name":"Peripheral devices",
            "description":"For RESET_OUT_N functionality, it connects to the reset input of peripheral devices."
          }
        ],
        "connectivity":"When used for SIM switching, it connects to the control input of an external SIM switch IC. When configured as a GPIO, it connects to external circuitry as a digital input/output. When used as RESET_OUT_N, it connects to the reset input of peripheral devices.",
        "detailed_description":"The Ext_SIM_switch pin is an output signal from the Semtech RC76xx module that is used to control an external SIM switch. This allows the module to select between two external SIM cards (UIM1_SIMA and UIM1_SIMB). The pin's functionality is managed by AT commands, specifically AT!CUSTOM=\"EXTUIMSWITCHEN\",1 to enable the feature, and then AT!ANTSEL=<band>,<gpio1>,<gpio2>,<gpio3>[,<gpio4>] to control the SIM selection based on the band.",
        "functionality":"This pin serves as an output to control an external SIM switch. It can also be configured as a general purpose Input/Output (GPIO) pin when the external SIM switch functionality is disabled. Additionally, it can function as a RESET_OUT_N signal, providing a reset signal to peripheral devices.",
        "precautions":"When configured for SIM switching, ensure the AT!CUSTOM=\"EXTUIMSWITCHEN\",1 command is used to enable the feature. When used as a GPIO or RESET_OUT_N, the SIM switching feature must be disabled using AT!CUSTOM=\"EXTUIMSWITCHEN\",0. Always refer to the AT command reference for specific configuration details and potential interactions with other pin functions."
      },
      "name":"Ext_SIM_switch",
      "pin_id":"46",
      "type":"DIGITAL"
    },
    "GND":{
      "description":"Main antenna\nGround",
      "direction":"INPUT",
      "group":"Ground",
      "if_unused":"Mandatory connection",
      "implementation":{
        "connected_components":[
          {
            "component_description":"The ground plane of the application board. This should be a solid, continuous plane under the module, with numerous via connections to other ground layers to ensure low impedance and good thermal conductivity.",
            "component_name":"Host PCB Ground Plane"
          }
        ],
        "connectivity":"All GND pins on the module must be connected to the ground plane of the host PCB. The datasheet recommends using a solid ground plane under the module and employing a high density of vias to connect this plane to other ground layers of the PCB. This ensures a robust ground connection and facilitates heat dissipation.",
        "detailed_description":"Ground is a common reference point for all electrical signals and power supply rails within the module. It is essential for signal integrity, proper operation of internal circuitry, and thermal dissipation. The module utilizes multiple GND pins to ensure robust grounding connections and to facilitate efficient heat transfer from the module to the host PCB. These pins are connected to the internal ground plane of the module, which is internally connected to the shield.",
        "functionality":"The GND pins primarily serve as the electrical ground reference for the module. They are also critical for establishing a low-impedance return path for RF signals, power supply currents, and high-speed digital signals. Additionally, the extensive ground connections contribute to the module's thermal management by acting as a heat sink to the host PCB.",
        "precautions":[
          "Ensure all GND pins are securely connected to the host PCB's ground plane. Inadequate grounding can lead to signal integrity issues, noise, and unreliable operation.",
          "Do not use GND pins for any signal routing. They are strictly for ground connections.",
          "When routing RF traces (RF_MAIN, RF_DIV, RF_GNSS), the associated GND pads should be considered an integral part of the RF interface. Ensure proper ground plane coverage around these pads.",
          "The ground plane connection is crucial for thermal dissipation. Ensure the thermal path from the module's GND pads to the host PCB's thermal management system is efficient."
        ]
      },
      "name":"GND",
      "pin_id":"139",
      "type":"POWER"
    },
    "GPIO13":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Module",
            "connection_details":"Connected to pin 44 (GPIO13) of the Semtech RC76xx module."
          }
        ],
        "connectivity":"GPIO13 should be connected as a General Purpose Input/Output. If unused, it should be left open.",
        "detailed_description":"GPIO13 is a General Purpose Input/Output pin. It is part of the Extension functionality group, meaning it provides additional capabilities beyond the core functions and its availability and location may vary across different Semtech CF3 modules. The pin is configured as a digital I/O with a pull-down resistor by default in its active state.",
        "functionality":"GPIO13 can serve as a General Purpose Input/Output pin. Its specific behavior, such as being a wakeable pin, is indicated as 'Yes' in the pin definition table, meaning it can be used to trigger the module to wake up from sleep mode. The default state is Pull Down (PD).",
        "precautions":[
          "The pin is marked as 'wakeable', so care should be taken if it is used as a standard GPIO to avoid unintentional wake-ups from sleep mode.",
          "As with other GPIO pins, there should not be any voltage applied to GPIO13 when the module is off or resetting."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO13",
      "pin_id":"44",
      "type":"DIGITAL"
    },
    "GPIO2":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"Host microcontroller's GPIO pins.",
        "connectivity":"When used as a general-purpose I/O, it is connected to the host microcontroller's GPIO. When used as a wakeup source, it is connected to a host signal that can transition to wake the device. The pin has an internal pull-down resistor.",
        "detailed_description":"GPIO2 is a general-purpose input/output pin that can be configured by the user. It is also capable of waking the device from a sleep state.",
        "functionality":"GPIO2 can function as a general-purpose input or output. It can also serve as a wakeup source when the device is in a sleep state.",
        "precautions":"The pin has an internal pull-down resistor. When the module is off or resetting, no voltage should be applied to the GPIOs. The pin is 'wakeable' and can be used to trigger the module to wake up from sleep mode."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO2",
      "pin_id":"10",
      "type":"DIGITAL"
    },
    "GPIO21":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Microcontroller/Processor",
            "connection_details":"Connect to a digital I/O pin on the host microcontroller for general purpose input/output functionality. If used for wake-up, connect to a GPIO output pin on the host."
          },
          {
            "component_name":"Pull-down Resistor",
            "connection_details":"An internal pull-down resistor is present, so an external pull-down is generally not required. However, if specific pull-up behavior is needed for wake-up functionality, an external pull-up resistor may be considered as per the module's documentation for wakeable pins."
          }
        ],
        "connectivity":"In a schematic, GPIO21 can be connected as a general-purpose digital input or output to the host system. If used as a wake-up source from Sleep state, it should be connected to a host control signal. The pin has an internal pull-down resistor in its default/active state.",
        "detailed_description":"GPIO21 is a General Purpose Input/Output pin that can be used by the host to control or monitor various functions. It is also designated as a wakeable pin, meaning it can be used to wake the module from a Sleep state. The specific behavior and configuration of GPIO21 can be managed through AT commands.",
        "functionality":"Yes, GPIO21 can serve different functions based on its configuration and the module's state. Primarily, it functions as a General Purpose Input/Output (GPIO). Additionally, it can act as a wakeable pin, allowing the host to wake the module from a Sleep state. The default state when the module is in active or sleep mode is a pull-down.",
        "precautions":[
          "The pin is 'wakeable', meaning transitions on this pin can wake the module from Sleep state. Ensure proper signal design to avoid unintended wake-ups.",
          "When the module is in PSM (Power Saving Mode), this pin is not a supported wake-up source.",
          "Avoid applying any voltage to the GPIOs when the module is off or resetting.",
          "The pin has an internal pull-down resistor in its default/active state. If connecting to a host output, ensure compatibility with this configuration."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO21",
      "pin_id":"147",
      "type":"DIGITAL"
    },
    "GPIO22":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific components are mandated for connection by default. Its connection depends on the intended use case, whether it's for controlling an external device (output) or receiving an input/wake signal.",
        "connectivity":"For general purpose use, it can be left unconnected if unused. If used as a wakeable input, it would be connected to a signal source that can assert the wake-up trigger. If configured as an output, it would be connected to the component that needs to be controlled by this GPIO.",
        "detailed_description":"GPIO22 is a General Purpose Input/Output pin. It is part of the core functions and is available across various RC76xx modules.",
        "functionality":"This pin can serve as a General Purpose Input/Output. Its default state when unused is 'leave open'. It is also marked as 'wakeable', meaning it can be used to trigger the module to wake up from a sleep state.",
        "precautions":"When the module is in sleep mode, this pin can be used to wake it up. If the module is in PSM mode, this pin is not a valid wakeup source. Ensure proper configuration using AT commands if specific behavior (like wake-up) is required."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO22",
      "pin_id":"148",
      "type":"DIGITAL"
    },
    "GPIO23":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific external components are mandated for basic connectivity. However, depending on its configured function (input or output), it may connect to other digital components in the system (e.g., buttons, LEDs, other ICs).",
        "connectivity":"It can be connected as a digital input or output. The default state is Pull Down (PD) in active status. If unused, it should be left open.",
        "detailed_description":"GPIO23 is a General Purpose Input Output pin that can be configured by the user. It is part of the Extension group of pins.",
        "functionality":"This pin can serve as a General Purpose Input Output. Its specific functionality is determined by user configuration via AT commands.",
        "precautions":"The pin is listed as 'Reserved' in some contexts within the document (though its pin number 149 is allocated). Users should ensure its intended use is supported by their specific module variant and firmware. It is generally advised not to apply voltage to GPIOs when the module is off or resetting."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO23",
      "pin_id":"149",
      "type":"DIGITAL"
    },
    "GPIO24":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific external components are mandated for connection to GPIO24 if it is to be used as a general-purpose I/O. However, its functionality might be influenced by other system components through software configuration.",
        "connectivity":"In a schematic, GPIO24 can be connected as a digital input or output depending on its configuration. If unused, it should be left open according to the pin definition table.",
        "detailed_description":"GPIO24 is a general-purpose input/output pin that can be configured by the user for various functionalities. It is part of the general-purpose input/output pins available on the Semtech RC76xx module.",
        "functionality":"Yes, GPIO24 can serve different functions based on connectivity and configuration. Its primary function is as a general-purpose input/output. It is also listed as an 'Extension' type pin, indicating it may have additional capabilities or specific configurations available through AT commands.",
        "precautions":"The pin has a default pull-down (PD) state in active mode. If the pin is to be used as an input, ensure the signal level is properly driven. If it's used as an output, ensure the connected circuitry respects the voltage and current capabilities. If left unused, it should be left open to ensure compatibility with other Semtech CF3 modules."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO24",
      "pin_id":"150",
      "type":"DIGITAL"
    },
    "GPIO25":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific components are mandated for connection, but it can interface with microcontrollers, sensors, or other digital components as a general-purpose I/O. If unused, it should not be connected to any component.",
        "connectivity":"Connect to a host microcontroller's GPIO pin or other digital logic. If unused, it should be left open.",
        "detailed_description":"GPIO25 is a general-purpose input/output pin, configurable by the user.",
        "functionality":"This pin can be configured as a general-purpose input or output.",
        "precautions":"Pull-up/pull-down resistors may be needed depending on the configuration and the specific application. Refer to the datasheet for specific electrical characteristics and default states."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO25",
      "pin_id":"159",
      "type":"DIGITAL"
    },
    "GPIO28":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"When used for antenna control, GPIO28 connects to components that manage tunable antennas.  When used as a general purpose I/O, it connects to other digital components in the system as required by the application.",
        "connectivity":"GPIO28 can be connected as a general purpose input or output.  It can also be connected to control signals for tunable antennas (ANT_CNTL1).",
        "detailed_description":"GPIO28 is a General Purpose Input/Output pin that can be configured and utilized for various custom functions as defined by the user.",
        "functionality":"Yes, GPIO28 can serve different functions. It can be configured as a general purpose input/output pin or used for specific antenna control functions. The specific functionality is determined by the user through AT commands like AT+WIOCFG and AT!ANTSEL.",
        "precautions":"GPIO28 should only be used when configured via AT commands.  Ensure proper configuration to avoid unintended behavior.  When used as an output, ensure the voltage and current ratings are not exceeded.  If the module is powered off or resetting, no voltage should be applied to this pin."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO28",
      "pin_id":"153",
      "type":"DIGITAL"
    },
    "GPIO29":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"When used as a GPIO, it can be connected to microcontrollers, sensors, or other digital components. When used for Antenna Control, it connects to antenna tuning circuitry, which may involve variable capacitors or other RF components. The specific components depend on the antenna design.",
        "connectivity":"If used as a GPIO, it should be connected to other digital logic components as per the desired application. If used for Antenna Control, it connects to the antenna tuning circuitry.",
        "detailed_description":"GPIO29 is a general-purpose input/output pin that can be configured for various functions through AT commands.",
        "functionality":"This pin can serve as a General Purpose Input/Output (GPIO) or as an Antenna Control signal (ANT_CNTL1).",
        "precautions":"The pin's function is configurable via AT commands (`AT+WIOCFG`). When not used, it should be left unconnected. If used as a GPIO, ensure proper voltage level compatibility (1.8V). When configured as a GPIO, it is pulled down by default."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO29",
      "pin_id":"154",
      "type":"DIGITAL"
    },
    "GPIO30":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Antenna Tuner",
            "connection_details":"If used for antenna control, it connects to an antenna tuner circuit to adjust antenna characteristics based on the RF band being used."
          },
          {
            "component_name":"Host Controller",
            "connection_details":"If used as a GPIO, it connects to the host controller for general purpose input/output operations."
          }
        ],
        "connectivity":"The pin can be configured as a GPIO or as an antenna control signal. If configured as a GPIO, it is a general-purpose input/output with a pull-down resistor. If configured for antenna control, it is used to control tunable antennas.",
        "detailed_description":"GPIO30 is a general-purpose input/output pin.",
        "functionality":[
          "General purpose Input/Output",
          "Antenna Control"
        ],
        "precautions":[
          "When configured as a GPIO, the pin should not be left floating if not used. It is recommended to connect it to a pull-down resistor.",
          "When configured for antenna control, ensure the correct AT commands are used to set the antenna control mode and the associated GPIO signals.",
          "Ensure proper routing of the pin to avoid interference with RF signals.",
          "The default state of the pin is a pull-down when used as a GPIO."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO30",
      "pin_id":"155",
      "type":"DIGITAL"
    },
    "GPIO31":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"If used as a general-purpose I/O, it can connect to microcontrollers, sensors, or other digital logic ICs. If used for antenna control, it connects to the control pin of a tunable antenna module or circuit.",
        "connectivity":"The pin can be left open if not used. If used as a general-purpose I/O, it can be connected to other digital components as an input or output. If used for antenna control, it connects to the control input of an external tunable antenna component. When used as a general-purpose I/O, it has a pull-down resistor enabled by default in active status.",
        "detailed_description":"GPIO31 is a General Purpose Input/Output pin, meaning it can be configured by the user to serve as either an input or an output for various digital signals. Its default state in an active system is a pull-down configuration, making it an input by default unless actively changed by software.",
        "functionality":"Yes, GPIO31 can serve different functions based on connectivity. It can be used as a general-purpose input/output pin, and also as an antenna control signal (ANT_CNTL3). The specific function is determined by software configuration, typically through AT commands like AT+WIOCFG for general I/O or AT!CUSTOM and AT!ANTSEL for antenna control.",
        "precautions":"When used as a general-purpose I/O, it should be configured using AT+WIOCFG. When used for antenna control, the ANT_CNTL configuration commands (AT!CUSTOM and AT!ANTSEL) must be used. Ensure that the pin is not connected to any signal that would violate its voltage or current ratings. It is also important to note that the 'Reserved' status of certain pins means they should not be connected to ensure compatibility."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO31",
      "pin_id":"156",
      "type":"DIGITAL"
    },
    "GPIO32":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External Logic/Controller",
            "connection_details":"Can be connected to microcontrollers, sensors, or other digital logic for control or status reporting. Requires consideration of voltage levels (1.8V) and pull-up/pull-down configurations."
          },
          {
            "component_name":"Pull-up/Pull-down Resistors",
            "connection_details":"Internal pull-down resistors are present. External pull-up or pull-down resistors may be needed depending on the application's specific requirements and the desired default state, as per AT command configuration."
          }
        ],
        "connectivity":"This pin can be configured as a general-purpose input or output. When used as an input, it can receive signals from external components. When used as an output, it can drive external components. The specific configuration (input or output, pull-up/pull-down) is determined by AT commands.",
        "detailed_description":"GPIO32 is a general-purpose input/output pin, part of the module's interface for external connectivity and control.",
        "functionality":[
          "General Purpose Input/Output"
        ],
        "precautions":[
          "Ensure that the voltage level of any connected external component does not exceed the 1.8V operating voltage of the GPIO.",
          "When the module is in Sleep or Off mode, external signals applied to this pin might affect power consumption or behavior. Refer to the documentation for specific behavior in different power states.",
          "The default state of the pin is a pull-down. If a different default behavior is required, it must be configured via AT commands.",
          "Avoid applying voltages to this pin when the module is powered off or in reset state to prevent potential damage."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO32",
      "pin_id":"104",
      "type":"DIGITAL"
    },
    "GPIO33":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host System GPIO Interface",
            "description":"Connect to a general-purpose input/output pin on the host microcontroller or processor."
          },
          {
            "component_name":"Pull-down Resistor (Internal)",
            "description":"An internal pull-down resistor is present and enabled by default in the active state. This ensures a defined low logic level when the pin is not actively driven."
          },
          {
            "component_name":"Wake-up Circuitry (Optional)",
            "description":"If used as a wake-up source, external circuitry (e.g., a switch or signal conditioning) may be needed to properly trigger the wake-up event, depending on the host's signal levels and the module's wake-up requirements."
          }
        ],
        "connectivity":"The pin should be connected to the host system's GPIO interface. If unused, it should be left open. If used as a wake-up source, appropriate external circuitry might be required depending on the host's implementation.",
        "detailed_description":"GPIO33 is a General Purpose Input/Output pin. It can be configured by the user to perform various input or output functions based on the application's needs. The default state is an input with a pull-down resistor enabled.",
        "functionality":"This pin can be configured as a General Purpose Input/Output. It can be used for various custom functions as determined by the application. Additionally, it can be wakeable, meaning it can trigger the module to wake up from a sleep state.",
        "precautions":[
          "The pin is wakeable from Sleep state. Ensure this is accounted for in system power management design.",
          "If unused, the pin should be left open. Avoid connecting it to any signal or voltage source unless explicitly configured for a specific function.",
          "When the module is in PSM or Off mode, the VGPIO (which powers this pin) is off. Ensure that any external circuitry connected to this pin does not cause unintended power draw or signal integrity issues when the module is in these low-power states.",
          "The default state for this pin when the module is active is input with a pull-down resistor. If the pin is to be used as an output or a different input configuration, it must be explicitly configured via AT commands (e.g., AT+WIOCFG)."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO33",
      "pin_id":"105",
      "type":"DIGITAL"
    },
    "GPIO35":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"If used as a general-purpose output, GPIO35 might be connected to components such as LEDs (potentially with a current-limiting resistor), transistors (for switching higher voltage/current loads), or directly to other digital input pins of microcontrollers or integrated circuits. If used as an input, it would connect to the output of a sensor or another digital signal source.",
        "connectivity":"In a schematic, GPIO35 can be connected as either an input or an output. If used as an input, it would connect to a signal source. If used as an output, it would connect to a device that can be controlled by a digital signal (e.g., an LED, a transistor for switching, etc.). If left unused, it should be left open.",
        "detailed_description":"GPIO35 is a general-purpose input/output pin that can be configured by the user. Its default state is a pull-down resistor enabled.",
        "functionality":"This pin is primarily a general-purpose input/output (GPIO). Its specific functionality can be configured by the user through AT commands, allowing it to be used for various purposes depending on the application's needs. However, the datasheet does not specify distinct alternate functions for GPIO35, implying its primary role is as a configurable I/O.",
        "precautions":"When using GPIO35, it's important to note that it has a default pull-down configuration. If the pin is not actively driven or connected, it will be held at a low logic level. Ensure that any external circuitry connected to GPIO35 does not violate the voltage or current specifications for the pin, as detailed in the datasheet's electrical characteristics for GPIOs. Additionally, if the module enters a low-power state (like Sleep or PSM), the behavior of GPIO pins might change, and specific configurations might be required to ensure proper wake-up or signal maintenance."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO35",
      "pin_id":"101",
      "type":"DIGITAL"
    },
    "GPIO4":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"For SIM Detect functionality, an external pull-up resistor is required. The specific value is not detailed, but it is implied to be necessary for the signal to transition correctly. For general purpose input, the module has an internal pull-down resistor.",
        "connectivity":"To use GPIO4 for SIM Detect:\n- Enable the external SIM detect feature using the AT command AT!CUSTOM=\"EXTUIMSWITCHEN\",1.\n- Select the SIM using AT+KSIMSEL=2.\n- Reboot the module.\n\nTo use GPIO4 as a general purpose input:\n- Disable the external SIM detect feature using AT!UNLOCK=\"A710\".\n- Configure the UIM2 interface to be disabled using AT+CUSTOM=\"UIM2ENABLE\",0.\n- Reboot the module.\n- Configure GPIO4 using the AT command AT+WIOCFG=4,4.\n\nFor SIM Detect, the signal needs an external pull-up resistor. The UIM detect signal transitions from low to high when a UIM is inserted, and from high to low when removed. The default state of GPIO4 is a digital input with pull-down.",
        "detailed_description":"GPIO4 is a General Purpose Input/Output pin. It can be used for two primary functions: SIM Detect for UIM2, or as a general-purpose input/output pin.",
        "functionality":"GPIO4 can function as:\n1. SIM Detect for UIM2: Detects the physical presence of a UIM card in the UIM2 holder.\n2. General Purpose Input/Output: Can be configured as a digital input for general use.",
        "precautions":"When using GPIO4 for SIM Detect, ensure the external pull-up resistor is properly implemented. When configuring GPIO4 as a general-purpose input, the external SIM detect feature must be disabled, and the UIM2 interface must be disabled. The default state of GPIO4 is a digital input with a pull-down, and its functionality can be altered via AT commands."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO4",
      "pin_id":"65",
      "type":"DIGITAL"
    },
    "GPIO42":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific external components are mandated for its basic GPIO function.  However, its wakeable functionality implies it could be connected to a signal from another component that triggers a wake-up event.",
        "connectivity":"As a GPIO, it can be configured as an input or output.  Specific configuration for its wakeable functionality or GPIO behavior is done via AT commands.",
        "detailed_description":"GPIO42 is a General Purpose Input/Output pin on the Semtech RC76xx module. It is wakeable, meaning it can be used to wake the module from a sleep state. Its default state is a pull-down.",
        "functionality":"GPIO42 can be used as a General Purpose Input/Output. It is also 'wakeable', allowing it to trigger the module to wake up from a sleep state.",
        "precautions":"The pin is wakeable, so care should be taken with external connections to prevent unintended wake-ups from sleep state.  The default state has an internal pull-down.  For specific configuration and usage details, AT commands such as AT+WIOCFG are referenced."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO42",
      "pin_id":"109",
      "type":"DIGITAL"
    },
    "GPIO6":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"SIM Switch",
            "component_type":"External",
            "connection_details":"Connect to the SIM switch control input. The state of GPIO6 (high or low) will control the switch to select between SIM A and SIM B."
          },
          {
            "component_name":"Peripheral Devices",
            "component_type":"External",
            "connection_details":"Connect to the reset input of peripheral devices. When configured as RESET_OUT_N, GPIO6 will drive these devices into reset or take them out of reset."
          },
          {
            "component_name":"Host Controller",
            "component_type":"External",
            "connection_details":"Can be connected as a digital input or output to the host controller for general purpose I/O functionality."
          }
        ],
        "connectivity":"For SIM Switching, enable via AT!CUSTOM=\"EXTUIMSWITCHEN\",1. For General Purpose Input/Output, disable SIM switching via AT!CUSTOM=\"EXTUIMSWITCHEN\",0 and configure GPIO6 using AT+WIOCFG=6,4. For RESET_OUT_N, disable SIM switching via AT!CUSTOM=\"EXTUIMSWITCHEN\",0 and configure GPIO6 using AT+WIOCFG=6,0. The default GPIO state is a digital input with a 10 µA pull-down function. When used as RESET_OUT_N, it is held low to reset peripheral devices during power-up and then turned high once the power-on sequence is complete.",
        "detailed_description":"GPIO6 is a General Purpose Input/Output pin that can also be configured to control an external SIM switch or function as a RESET_OUT_N signal.",
        "functionality":"GPIO6 can be used for three different functions: SIM Switching, General Purpose Input/Output, or as a RESET_OUT_N signal.",
        "precautions":[
          "The default GPIO state is a digital input with a 10 µA pull-down function.",
          "When configuring GPIO6 for different functions, a reboot of the module may be required.",
          "If used as RESET_OUT_N, it is held low during module reset or power-up and then turned high once the power-on sequence is complete. It maintains its previous state during PSM.",
          "The signal is available for use when configured using AT+WIOCFG. Refer to the RC76xx AT Command Reference for details."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO6",
      "pin_id":"46",
      "type":"DIGITAL"
    },
    "GPIO7":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific connected components are mandated by the datasheet for GPIO7's general function. Its use as a wake-up source would depend on the host system's design and the specific events it needs to signal. If left unused, it can be left open or connected to ground.",
        "connectivity":"GPIO7 can be connected as a digital input or output. When used as a wake-up source, it should be connected to a signal that can trigger the module from sleep. If unused, it should be left open or connected to ground to maintain its default state.",
        "detailed_description":"GPIO7 is a General Purpose Input/Output pin. It is a wakeable pin, meaning it can be used to wake the module from a sleep state. The default state of GPIO7 is configured as an input with a pull-down resistor. It is available for general purpose use.",
        "functionality":"GPIO7 can function as a General Purpose Input/Output pin. It can also act as a wakeable interrupt source, allowing it to wake the module from a sleep state.",
        "precautions":"When the module is in sleep mode, transitions on GPIO7 can wake the module. If the module is in PSM, GPIO7 cannot be used as a wakeup source; only POWER_ON_N and RESET_IN_N are supported. Additionally, no voltage should be applied to the GPIOs when the module is off or resetting."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO7",
      "pin_id":"40",
      "type":"DIGITAL"
    },
    "GPIO8":{
      "description":"General purpose I/\nO",
      "direction":"BIDIRECTIONAL",
      "group":"GPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"No specific connected components are mandated by the datasheet. The connection will depend on the specific application's requirement for GPIO8.",
        "connectivity":"When used as a general-purpose input, GPIO8 should be connected to a signal source. When used as a general-purpose output, it can be connected to a load or indicator.  If unused, it should be left open.",
        "detailed_description":"GPIO8 is a general-purpose input/output pin. It can be configured to perform various functions based on the system's needs.  The pin's default state is as a general-purpose input.",
        "functionality":"GPIO8 can function as a general-purpose input or output. Its specific behavior can be configured through software, allowing it to be used for various control or monitoring tasks.",
        "precautions":"As with all GPIO pins, care should be taken to ensure that the voltage levels connected to GPIO8 are within the specified operating voltage range for the module.  Refer to the datasheet for precise voltage specifications.  The datasheet does not specify any special precautions beyond standard GPIO usage."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"GPIO8",
      "pin_id":"41",
      "type":"DIGITAL"
    },
    "I2C1_CLK":{
      "description":"I2C Clock",
      "direction":"BIDIRECTIONAL",
      "group":"I2C",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"This pin needs to be connected to the CLK pin of the I2C bus of other devices (e.g., sensors, microcontrollers) that the RC76xx module will communicate with.",
        "connectivity":"This pin should be connected to the I2C bus clock line. The interface uses 1.8V logic, and the signals are implemented internally as open drain outputs with 2.5 kΩ pull-up resistors to VGPIO.",
        "detailed_description":"I2C1_CLK is the clock signal for the I2C1 interface. The Semtech RC76xx module provides one I2C (Inter-Integrated Circuit) dedicated serial port (bus interface) based on I2C Bus Specification, Version 5.0, October 2012. This interface uses pin 1 for the clock signal and pin 66 for the data signal.",
        "functionality":"This pin serves as the I2C clock signal. The module operates only in master mode for this interface.",
        "precautions":"The I2C1_CLK pin has internal pull-up resistors. Ensure that when connecting to other I2C devices, the bus is correctly terminated according to I2C standards. Avoid connecting any external pull-up resistors as it may interfere with the internal configuration."
      },
      "internal_pull":{
        "direction":"UP",
        "pull_value":{
          "nom":2.2,
          "units":"kΩ"
        }
      },
      "name":"I2C1_CLK",
      "pin_id":"1",
      "reset_state":"Internal pull-down",
      "type":"DIGITAL"
    },
    "I2C1_Data":{
      "description":"I2C data",
      "direction":"BIDIRECTIONAL",
      "group":"I2C",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"RC76xx Module",
            "pin_name":"I2C1_DATA"
          },
          {
            "component_name":"I2C Slave Device(s)",
            "pin_name":"SDA (Serial Data)"
          },
          {
            "component_name":"Pull-up Resistor",
            "pin_name":"Connects I2C1_DATA to VGPIO",
            "resistance_value":"2.2 kΩ (recommended)"
          },
          {
            "component_name":"VGPIO",
            "pin_name":"Power supply for pull-up resistor"
          }
        ],
        "connectivity":"The I2C1_DATA pin should be connected to the corresponding data pin (SDA) of the I2C slave device(s) in the system. It is an open-drain output, meaning it requires external pull-up resistors. These pull-up resistors should be connected to the VGPIO supply. The datasheet recommends internal pull-up resistors with a value of 2.2 kΩ to VGPIO.",
        "detailed_description":"The I2C1_DATA pin is part of the I2C1 interface, which is a dedicated serial port based on the I2C Bus Specification. This interface allows the RC76xx module to communicate with other I2C devices. The module operates as an I2C master, meaning it initiates and controls the communication on the bus.",
        "functionality":"The pin serves as the data line for the I2C communication. It is used for both sending and receiving data between the RC76xx module (as the master) and any connected I2C slave devices. Its functionality is tied to the I2C1_CLK pin.",
        "precautions":[
          "The I2C1_DATA pin is open-drain and requires external pull-up resistors to VGPIO.",
          "The recommended value for the pull-up resistor is 2.2 kΩ. The datasheet also mentions internal pull-up resistors, but it's good practice to implement external ones for robust design.",
          "The I2C interface operates at 1.8V, so ensure that connected slave devices are compatible with this voltage level.",
          "An I2C slave address of 0x1A is reserved for internal use by the module. Avoid using this address for any external I2C devices.",
          "Ensure that the total capacitance on the I2C bus (including trace capacitance and slave device capacitance) does not exceed the limits specified by the I2C standard to maintain proper communication speeds."
        ]
      },
      "internal_pull":{
        "direction":"UP",
        "pull_value":{
          "nom":2.2,
          "units":"kΩ"
        }
      },
      "name":"I2C1_Data",
      "pin_id":"66",
      "type":"DIGITAL"
    },
    "I2S_CLK":{
      "description":"I2S Clock\nThe frame bit clock signal controls data\ntransfer with the audio peripheral.",
      "direction":"OUTPUT",
      "group":"I2S",
      "if_unused":"Pull High",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External I2S Audio Codec (DAC/ADC)",
            "connection_details":"The I2S_CLK pin of the module connects to the SCK (Serial Clock) pin of the external audio codec. The module acts as the master for the I2S clock. The external codec's SCK input receives the clock signal from the module."
          }
        ],
        "connectivity":"When the digital audio interface is configured for I2S, this pin should be connected to the SCK (Serial Clock) input of the external I2S-compatible audio codec (DAC/ADC).",
        "detailed_description":"The I2S_CLK pin is part of the I2S (Inter-IC Sound) digital audio interface. In this context, it serves as the bit clock signal that controls the data transfer rate between the module and an external stereo DAC/ADC.",
        "functionality":"The pin is configured as an Output when the digital audio interface is set to I2S mode. It provides the I2S clock signal. The functionality of this pin is dependent on the module's audio interface configuration being set to I2S. If the audio interface is configured for PCM, this pin would be PCM_CLK.",
        "precautions":[
          "The module acts as the master for the I2S clock, so ensure the external codec is configured to accept the clock from a master source.",
          "The I2S interface supports a sampling rate of 16 kHz and a bit clock of 512 kHz. Ensure the external codec is compatible with these specifications.",
          "The pin is pulled high by default in its reset state when configured for I2S. If the audio interface is configured for PCM, it defaults to a pull-down.",
          "The module's audio availability is firmware-dependent. Ensure the firmware supports I2S audio configuration."
        ]
      },
      "name":"I2S_CLK",
      "pin_id":"36",
      "reset_state":"Pull High",
      "type":"DIGITAL"
    },
    "I2S_IN":{
      "description":"I2S Data In\nThe frame “data in” relies on the selected\nconfiguration mode.",
      "direction":"INPUT",
      "group":"I2S",
      "if_unused":"Pull Down",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External Stereo DAC/ADC",
            "description":"A digital-to-analog converter (DAC) or analog-to-digital converter (ADC) that supports the I2S protocol. This component will provide the digital audio data that is fed into the RC76xx module via the I2S_IN pin."
          }
        ],
        "connectivity":"This pin should be connected to the corresponding data output pin of an external audio component (e.g., a stereo DAC/ADC) that also supports the I2S protocol. The connection carries the digital audio data stream from the external component to the RC76xx module.",
        "detailed_description":"The I2S_IN pin is part of the I2S (Inter-IC Sound) digital audio interface. It serves as the input for serial digital audio data that is transferred to the Semtech RC76xx module from an external stereo DAC/ADC. The I2S interface allows for the transfer of digital audio information between the module and external audio components.",
        "functionality":"This pin can function as part of the I2S digital audio interface. When the module's audio interface is configured for I2S operation, this pin receives the digital audio data. It is also mentioned that the I2S_OUT pin serves as the I2S Data Out. The pin is also part of the PCM/I2S interface signals, indicating it can be used in either PCM or I2S mode, but for I2S mode, it specifically handles the input data.",
        "precautions":[
          "The I2S interface only supports master mode operation, meaning the Semtech RC76xx module controls the clock and word select signals.",
          "The I2S interface only supports a sampling rate of 16 kHz and 16 bits per frame. Ensure the external audio component is configured to match these parameters.",
          "The I2S_IN pin has a default reset state of Pull Down.",
          "If the I2S interface is not used, this pin should be left unconnected (pulled down).",
          "The I2S interface operates at 1.8V logic levels. Ensure the connected external audio component is compatible with this voltage level."
        ]
      },
      "name":"I2S_IN",
      "pin_id":"34",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "I2S_OUT":{
      "description":"I2S Data Out\nThe frame “data out” relies on the\nselected configuration mode.",
      "direction":"OUTPUT",
      "group":"I2S",
      "if_unused":"Pull Down",
      "implementation":{
        "connected_components":"The I2S_OUT pin connects to the data input pin of an external audio device, such as a Digital-to-Analog Converter (DAC) or Analog-to-Digital Converter (ADC) that supports the I2S protocol. This could be a dedicated audio codec chip. The connection would be from I2S_OUT on the module to the data input (e.g., DIN, SDATA) on the audio codec. If configured for PCM, it connects to a PCM input on an audio device.",
        "connectivity":"In a schematic, the I2S_OUT pin should be connected to the data input pin of an external audio codec (DAC/ADC) or other audio processing device that supports the I2S interface. If the PCM interface is used, it connects to the PCM_OUT pin of the module, which would connect to the corresponding PCM input on the external device.",
        "detailed_description":"The I2S_OUT pin is part of the digital audio interface and is used to transmit serial digital audio data from the Semtech RC76xx module to an external stereo DAC/ADC. It is part of the I2S (Inter-IC Sound) interface, which allows for the transfer of digital audio data.",
        "functionality":"The I2S_OUT pin can serve multiple functions depending on the selected audio interface configuration. When the digital audio interface is configured as I2S, this pin functions as the I2S Data Out. If the interface is configured as PCM, this pin is named PCM_OUT and carries PCM data. The function is determined by firmware configuration.",
        "precautions":"The I2S_OUT pin is an output from the module. The module's datasheet specifies that when the I2S interface is used, this pin should be connected to a pull-down resistor if it is unused. The voltage level for this interface is 1.8V. Ensure that the external device connected to I2S_OUT is compatible with I2S protocol and the specified voltage levels. Firmware configuration is required to enable and select the I2S interface."
      },
      "name":"I2S_OUT",
      "pin_id":"33",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "I2S_WS":{
      "description":"I2S Word Select\nThe word select clock indicates which\nchannel is currently being transmitted\n(low cycle indicates left audio channel,\nhigh cycle indicates right audio channel).",
      "direction":"OUTPUT",
      "group":"I2S",
      "if_unused":"Pull Down",
      "implementation":{
        "connected_components":"The I2S_WS pin connects to the Word Select (WS) input of the external I2S audio device (e.g., a DAC or ADC).",
        "connectivity":"In I2S mode, I2S_WS is an output from the module. It should be connected to the corresponding WS input of the I2S master device (e.g., an audio codec).",
        "detailed_description":"The I2S_WS (Word Select) signal for the I2S audio interface indicates which audio channel is currently being transmitted or received. Typically, a low cycle indicates the left audio channel, and a high cycle indicates the right audio channel.",
        "functionality":"The I2S_WS signal can serve as a PCM_SYNC signal when the digital audio interface is configured for PCM mode.",
        "precautions":"When the module is in reset or powering up, the I2S_WS pin has a pull-down reset state. Ensure that the connected I2S device handles this state appropriately. If the digital audio interface is not used, this pin should be left open or pulled down."
      },
      "name":"I2S_WS",
      "pin_id":"35",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "J1":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":"No specific components are listed that need to be connected to J1. It is intended for direct connection to test equipment during debugging or RMA processes.",
        "connectivity":"The datasheet explicitly states that J1 is a mandatory test point and should be connected as such. No specific external component connection details are provided for J1, beyond its nature as a test point.",
        "detailed_description":"Test point J1 is a mandatory test point for Semtech RMA and debug service. It is described as a generic test point for module integration and testing purposes.",
        "functionality":"The primary function of J1 is to serve as a test point. Its specific use case or functionality is not detailed beyond being a mandatory test point for debugging and RMA purposes. It is not described as having multiple functions based on connectivity.",
        "precautions":"The datasheet categorizes J1 as a 'Mandatory test point'. While no specific precautions are listed for its electrical connection, the general context of test points suggests careful handling during debugging to avoid damage to the module or test equipment."
      },
      "name":"J1",
      "pin_id":"236",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J2":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":[
          {
            "component_details":"A physical point on the PCB designed for probing with test equipment. It is typically a small pad or a castellated edge feature, allowing for easy access by a probe or clip.",
            "component_name":"Test Point"
          }
        ],
        "connectivity":"J2 should be connected to a test point on the application board's PCB. This test point should be accessible for probing by Semtech technicians.",
        "detailed_description":"J2 is a test point pin on the RC76xx module. It is intended for use by Semtech during RMA (Return Material Authorization) debugging and potentially by the customer for development or diagnostic purposes.",
        "functionality":"The primary function of J2 is as a test point. Semtech requires test points on the customer application board for their RMA and debug services. While not explicitly stated to have other functions, test points are often used for signal monitoring or manual intervention during testing.",
        "precautions":"Semtech requires test points on the customer application for RMA and debug services. Ensure that this pin is made accessible for testing. It is recommended to have this test point readily available on the application board."
      },
      "name":"J2",
      "pin_id":"237",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J3":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":"The pin J3 should be connected to a test probe or a dedicated test connector on the host PCB during development and testing phases. It is intended for use by Semtech personnel for diagnostic purposes.",
        "connectivity":"J3 should be connected to a test point on the host platform. This connection is mandatory for Semtech's testing and debugging purposes. In a schematic, this would typically be represented as a net connected to a component designated as a 'Test Point' or 'TP'.",
        "detailed_description":"J3 is a test point provided on the module for RMA and debug services by Semtech. It is a mandatory test point for these purposes.",
        "functionality":"The pin J3 is exclusively a test point. Its function is to provide a physical access point for testing and debugging activities conducted by Semtech, particularly for Return Material Authorization (RMA) processes. It does not have alternative functionalities based on connectivity.",
        "precautions":"This pin is specifically for Semtech's use and should not be connected to any other circuitry by the end-user during normal operation. It is essential to ensure that this test point is accessible for Semtech's debugging and RMA processes. Connecting other components or signals to J3 may interfere with Semtech's testing and could potentially lead to incorrect diagnoses or damage."
      },
      "name":"J3",
      "pin_id":"238",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J4":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":"No specific components are mandated to be connected to J4 in a standard operational schematic. Its purpose is for direct probing by test equipment or by Semtech support personnel.",
        "connectivity":"The pin should be connected to a test point on the host platform's PCB. This allows for external access during testing or debugging by Semtech personnel. It is recommended that this test point is accessible.",
        "detailed_description":"J4 is a test point pin. These pins are provided by Semtech for RMA (Return Material Authorization) and debug services.",
        "functionality":"The primary function of J4 is to serve as a test point. It may be used for diagnostic purposes by Semtech during RMA or debugging processes. It is not intended for standard operational use by the end-user.",
        "precautions":"This pin is intended for test and debug purposes only. It should not be connected to any active circuitry in the final product design unless specifically instructed by Semtech for a particular debugging scenario. It is recommended to leave this pin unconnected in the final product design to avoid potential interference or unintended behavior."
      },
      "name":"J4",
      "pin_id":"239",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J5":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":"As a test point, J5 is intended to be connected to testing equipment or diagnostic tools. The specific equipment or tools are not detailed in this excerpt but would typically involve probes or specialized test fixtures used during development, manufacturing, or repair.",
        "connectivity":"J5 should be connected as a test point on the application board. This means it should be accessible via a probing mechanism during testing or debugging operations.",
        "detailed_description":"Pin J5 is designated as a test point. Test points are provided on the application board for Semtech RMA (Return Material Authorization) and debug service purposes. This implies it's an interface for diagnostic or testing functionalities.",
        "functionality":"The primary function of J5 is to serve as a test point. The specific function it provides during testing or debugging is not detailed beyond being a 'test point' itself. However, the document implies it might be related to 'Extension' type functionalities, as indicated in the 'Type' column for this pin.",
        "precautions":"The pin is marked as 'Mandatory test point', indicating its importance for diagnostic and support purposes. It is important to ensure this test point is made accessible on the PCB layout. While not explicitly stated for J5, generally test points are not meant to be connected to any active circuitry unless specified for a particular test or debug procedure. For any 'Extension' type pin, it's good practice to refer to the specific functionality it might enable for any usage precautions."
      },
      "name":"J5",
      "pin_id":"240",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J6":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":"The pin should be connected to a test point on the application board's PCB. No other specific components are mandated for connection to this pin, as its purpose is for direct probing.",
        "connectivity":"When integrating the Semtech RC76xx module, it is mandatory to provide a connection to this pin. It should be connected to a test point on the host platform. The pin is designated as 'Mandatory test point' in the documentation.",
        "detailed_description":"Pin J6 is a test point provided by Semtech for RMA and debug service. It is intended for use by Semtech personnel for diagnostic purposes.",
        "functionality":"This pin is exclusively a test point. Its primary function is to allow Semtech support to diagnose issues during the return merchandise authorization (RMA) process or for general debugging purposes.",
        "precautions":"While it is mandatory to provide a connection to this pin via a test point on the PCB, it is not intended for customer use during normal operation. It should be left unconnected to any active circuitry by the end-user. The pin's electrical characteristics are specified as 1.8V, and it is listed as an 'Extension' type, indicating it is not part of the core functionality."
      },
      "name":"J6",
      "pin_id":"241",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J7":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":[
          {
            "component_description":"A physical point on the PCB designed for probing with test equipment (e.g., oscilloscope, multimeter) during development, testing, or debugging. It allows access to the signal for measurement or manipulation.",
            "component_name":"Test Point"
          }
        ],
        "connectivity":"The pin should be connected to a test point on the host platform. This connection is for diagnostic purposes and is not part of the operational interface of the module. It is listed as a 'Recommended Test Pin' in the datasheet.",
        "detailed_description":"J7 is a test point pin for debugging and RMA (Return Material Authorization) purposes. Semtech requires test points on the customer application for Semtech RMA and debug service.",
        "functionality":"This pin is designated as a test point. Its primary function is to allow for diagnostic testing and potential RMA support by Semtech. It does not have a specific defined electrical function for normal operation of the module but is crucial for development and troubleshooting.",
        "precautions":[
          "Ensure this pin is accessible for testing and debugging, as recommended by Semtech.",
          "While not a critical operational pin, avoid connecting any active circuitry to this pin unless specifically instructed for a debugging scenario, as it could interfere with diagnostic procedures.",
          "Refer to Section 4.22 'Test Pins' and Section 10.1 'Pin Configuration' for specific recommendations regarding the use and accessibility of test points."
        ]
      },
      "name":"J7",
      "pin_id":"242",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J8":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":"The datasheet indicates that J8 should be connected to a 'test point'. No specific external components are listed as being directly connected to J8, but rather it is intended to be accessible via a test point on the application board.",
        "connectivity":"J8 should be connected to a test point on the host platform. The datasheet specifies it as a 'Mandatory test point'.",
        "detailed_description":"J8 is a test point on the Semtech RC76xx module. Test points are provided for Semtech RMA and debug service. The specific purpose or function of J8 is not explicitly defined beyond being a general test point.",
        "functionality":"The pin J8 is designated as a test point. Its primary function is to allow for debugging and potential Returns Material Authorization (RMA) testing by Semtech. It does not appear to have a user-configurable functionality or different functions based on connectivity as described in the provided text.",
        "precautions":"The datasheet states that 'Accessibility restricted to soldered-down modules. Not available for socket-mounted modules.' It is also listed as a mandatory test point, implying its importance for diagnostics and support."
      },
      "name":"J8",
      "pin_id":"243",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "J9":{
      "description":"Test point",
      "direction":"OUTPUT",
      "group":"Test point",
      "if_unused":"Mandatory\ntest point",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Test Point",
            "description":"A point on the host platform's PCB designated for electrical testing or probing."
          },
          {
            "component_name":"RMA Debugging Equipment",
            "description":"Specialized equipment used by Semtech for diagnosing issues with returned modules."
          }
        ],
        "connectivity":"Connect J9 to a test point on the host platform. If the host platform has an external connector for debugging purposes, connect J9 to that connector.",
        "detailed_description":"Pin J9 is a test point. Its primary purpose is for use in RMA (Return Material Authorization) debugging by Semtech.",
        "functionality":"Pin J9 serves as a test point. While not essential for normal operation, it is intended for diagnostic purposes by Semtech during return material authorization processes. If not used for RMA debugging, it is recommended to connect it to a test point on the host platform.",
        "precautions":[
          "Pin J9 is not mandatory for the module's normal operation. However, it is recommended to connect it to a test point for potential future debugging needs by Semtech.",
          "Ensure that the test point is accessible and properly labeled if it is intended for host platform testing.",
          "Avoid applying any voltage or signal to J9 unless specifically instructed by Semtech for debugging purposes, as it is a test pin and not a standard functional interface."
        ]
      },
      "name":"J9",
      "pin_id":"244",
      "type":"DIGITAL",
      "voltage":"1.8V"
    },
    "PCM_CLK":{
      "description":"PCM Clock\nThe frame bit clock signal controls data\ntransfer with the audio peripheral.",
      "direction":"BIDIRECTIONAL",
      "group":"PCM",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"PCM Clock output from the module connects to the clock input of an audio peripheral (e.g., codec, DSP). The specific peripheral will have a corresponding clock input pin.",
        "connectivity":"In PCM Master mode, this pin should be connected as an output clock signal to the audio peripheral. When used in Primary mode, the connection details are not explicitly defined beyond its Input/Output nature.",
        "detailed_description":"The PCM_CLK pin is part of the 4-wire digital audio interface, which can be configured as either PCM (Pulse Code Modulation) or I2S (Inter-IC Sound). When configured for PCM, it serves as the PCM Clock signal. In Master mode, it acts as an output that controls data transfer with the audio peripheral. In Primary mode, its role is described as 'Input/Output', indicating it might function as both an input and output depending on the specific configuration or context, but its primary role in PCM Master mode is an output clock.",
        "functionality":"PCM Clock (Output in Master mode), Input/Output in Primary mode",
        "precautions":"When the module is in PCM Master mode, this pin is an output. Ensure proper termination or connection to prevent signal integrity issues. The datasheet also specifies that in Primary mode, it is an Input/Output, which might require further clarification depending on the specific implementation or configuration settings related to 'Primary mode'."
      },
      "name":"PCM_CLK",
      "pin_id":"36",
      "reset_state":"Pull High",
      "type":"DIGITAL"
    },
    "PCM_IN":{
      "description":"PCM Data In\nThe frame “data in” relies on the selected\nconfiguration mode.",
      "direction":"INPUT",
      "group":"PCM",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Audio Codec / External Audio Peripheral",
            "connection_details":"Connect the PCM_IN pin of the RC76xx module to the corresponding PCM_IN pin of the audio codec or external audio peripheral. If the interface is configured for I2S, connect to the I2S_IN pin."
          },
          {
            "component_name":"RC76xx Module",
            "connection_details":"The PCM_IN pin (pin 34) on the RC76xx module."
          }
        ],
        "connectivity":"In PCM mode, PCM_IN should be connected to the PCM_IN pin of the audio codec or external audio peripheral. A 'Pull Down' configuration is recommended for the reset state. If the digital audio interface is configured for I2S mode, PCM_IN should be connected to the I2S_IN pin of the audio codec. In this case, a 'Pull Down' is also recommended for the reset state.",
        "detailed_description":"The PCM_IN pin is part of the 4-wire digital audio interface of the Semtech RC76xx module. This interface can be configured as either PCM (Pulse Code Modulation) or I2S (Inter-IC Sound). When configured for PCM, PCM_IN serves as the input for PCM Data. The frame synchronization signal (PCM_SYNC) synchronizes the data in and out of the module. The clock signal (PCM_CLK) controls the data transfer with the audio peripheral. The data format is 16-bit linear, with a specific PDM bit format (S DDD DDDD DDDD DDVV), where S is the signed bit, D is data, and V is volume padding.",
        "functionality":"The PCM_IN pin's primary function is to receive PCM Data when the digital audio interface is configured for PCM mode. If the interface is configured for I2S mode, this pin serves as the I2S_IN pin, receiving I2S Data.",
        "precautions":[
          "When the module is in its reset state, it is recommended to have a pull-down configuration on this pin.",
          "Audio availability is firmware-dependent; ensure the firmware supports PCM or I2S audio interface.",
          "If the interface is configured for PCM, a 'Leave open' state is recommended if unused.",
          "If the interface is configured for I2S, a 'Pull Down' state is recommended if unused."
        ]
      },
      "name":"PCM_IN",
      "pin_id":"34",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "PCM_OUT":{
      "description":"PCM Data Out\nThe frame “data out” relies on the\nselected configuration mode.",
      "direction":"OUTPUT",
      "group":"PCM",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External Audio Codec/Processing Unit",
            "connection_details":"Connect PCM_OUT pin to the data input of the external audio codec/processing unit.",
            "description":"This is an external chip responsible for converting the digital audio signal from PCM_OUT into an analog signal or further processing the digital audio data. It would have a corresponding data input pin that accepts the PCM_OUT signal."
          },
          {
            "component_name":"External I2S Audio Peripheral",
            "connection_details":"Connect PCM_OUT pin (when configured as I2S_OUT) to the I2S data input of the external I2S audio peripheral.",
            "description":"If the pin is configured as I2S_OUT, it connects to the I2S data input of a compatible I2S audio peripheral. This peripheral could be a DAC, ADC, or DSP that understands the I2S protocol."
          }
        ],
        "connectivity":"The PCM_OUT pin should be connected to the data input of an external audio codec or processing unit. When configured as I2S_OUT, it connects to the I2S data input of a compatible audio peripheral. The pin should be connected to the input of the downstream audio device.",
        "detailed_description":"PCM_OUT is a digital output signal used for transmitting Pulse Code Modulation (PCM) data. PCM is a method used to digitally represent analog signals. In the context of this module, it's used for audio communication.",
        "functionality":"This pin can also be configured as I2S_OUT (Inter-IC Sound). The functionality (PCM or I2S) depends on the selected configuration mode within the module's firmware.",
        "precautions":[
          "The functionality (PCM or I2S) must be configured via the module's firmware.",
          "Ensure the output voltage level (1.8V) is compatible with the connected external audio device.",
          "The 'If Unused' state for PCM_OUT is 'Leave open'. However, if configured as I2S_OUT, the recommendation changes to 'Pull Down'. Therefore, if the pin is not used, it should be left open unless I2S configuration is intended, in which case it should be pulled down.",
          "Refer to the specific audio codec or processing unit datasheet for its input requirements and recommended external components."
        ]
      },
      "name":"PCM_OUT",
      "pin_id":"33",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "PCM_SYNC":{
      "description":"PCM Sync\nThe frame synchronization signal delivers\nan 16 kHz frequency pulse that\nsynchronizes the frame data in and the\nframe data out.",
      "direction":"BIDIRECTIONAL",
      "group":"PCM",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Audio Codec / Peripheral",
            "connection_details":"Connect the PCM_SYNC pin (Pin 35) of the RC76xx module to the corresponding synchronization input pin of the audio codec or peripheral device."
          },
          {
            "component_name":"Internal Pull-down Resistor",
            "connection_details":"The pin has an internal pull-down resistor, which is active in the reset state."
          }
        ],
        "connectivity":"The PCM_SYNC pin should be connected to the corresponding synchronization pin of the audio codec or peripheral. In PCM Master mode, the module drives this signal. The pin has an internal pull-down resistor, but it is also specified to be 'Leave open' if unused, suggesting it is not actively pulled high by default and might rely on the connected peripheral for signal level maintenance in some configurations.",
        "detailed_description":"The PCM_SYNC signal is a frame synchronization signal. In PCM Master mode, it delivers a 16 kHz frequency pulse that synchronizes the frame data in and the frame data out. This signal is crucial for aligning the audio data stream between the module and the audio peripheral.",
        "functionality":"The PCM_SYNC signal acts as both an input and output. In PCM Master mode, it functions as an output to synchronize the audio peripheral. It also has a secondary function as an input, potentially for specific configurations or future enhancements, although its primary role in Master mode is as an output synchronizer.",
        "precautions":[
          "In PCM Master mode, the module drives the PCM_SYNC signal. Ensure the connected audio peripheral is configured to accept this synchronization signal.",
          "If the PCM_SYNC pin is not used, it should be left open. However, it also has an internal pull-down resistor.",
          "The reset state has an internal pull-down, which might affect the signal level if not properly managed during initialization.",
          "The datasheet mentions 'Input/Output in Primary mode', implying that while it's primarily an output in Master mode, there might be specific input uses or configurations to be aware of."
        ]
      },
      "name":"PCM_SYNC",
      "pin_id":"35",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "POWER_ON_N":{
      "description":"Power On control\nsignal",
      "direction":"INPUT",
      "group":"Control\nSignal",
      "if_unused":"Mandatory connection",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Processor GPIO",
            "description":"A GPIO pin from the host microcontroller can be used to control the POWER_ON_N pin, allowing software-initiated power control."
          },
          {
            "component_name":"Push Button/Switch",
            "description":"A momentary push button or switch can be connected between the POWER_ON_N pin and ground to allow manual power control."
          },
          {
            "component_name":"Open Collector/Open Drain Transistor",
            "description":"An external open collector or open drain transistor can be used to drive the POWER_ON_N pin to ground."
          },
          {
            "component_name":"Internal Pull-up Resistor",
            "description":"The pin has an internal pull-up resistor. The nominal voltage when floating is approximately 0.8V."
          }
        ],
        "connectivity":"The pin should be connected to a control mechanism (e.g., a button, switch, or a host processor's GPIO) that can drive it to ground when needed to power on or off the module. It is internally pulled-up, so no external pull-up resistor should be added.",
        "detailed_description":"The POWER_ON_N pin is a low-level signal used to switch the Semtech RC76xx module ON or OFF. It is internally pulled-up. To turn the module ON, this pin should be connected to ground for at least 200 ms and not more than approximately 7 seconds. If it remains grounded for longer than 7 seconds, the module will start and then power off once the pin is released. To turn the module OFF via software, the AT!POWERDOWN command should be used. Asserting POWER_ON_N to low for more than 1 second while the module is in an active power state will also turn the module OFF.",
        "functionality":"The pin's primary function is to control the power state of the module, switching it between ON and OFF. It also plays a role in the power-up sequence and can initiate a power-off sequence.",
        "precautions":[
          "Do not design any external pull-up circuit on this pin, as it is internally pulled-up. This could cause damage or abnormal power-on behavior.",
          "If the module experiences six consecutive under-voltage lockout (UVLO) events less than approximately 45 seconds apart without a host-initiated power down or reset, the device enters a mode where only the DM port enumerates on the USB.",
          "When powering on the module, ensure POWER_ON_N is asserted low for at least 200 ms and not more than ~7s.",
          "If POWER_ON_N remains connected to GND for more than ~7s, the module will start and turn off once POWER_ON_N is released.",
          "When the module is in PSM or off mode, the VGPIO pin is in high impedance. Ensure connected signals are in a high impedance or floating state to avoid extra power consumption."
        ]
      },
      "internal_pull":{
        "direction":"UP",
        "pull_value":{
          "nom":200,
          "units":"kΩ"
        }
      },
      "name":"POWER_ON_N",
      "pin_id":"59",
      "type":"DIGITAL",
      "voltage":"0.8V"
    },
    "RESET_IN_N":{
      "description":"External Reset Input",
      "direction":"INPUT",
      "group":"Control signal",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host platform control mechanism (e.g., button, switch, jumper)",
            "connection_type":"Open-drain/open-collector to ground"
          },
          {
            "component_name":"Internal pull-up resistor",
            "connection_type":"Internal connection to ~40k Ohms"
          }
        ],
        "connectivity":"The RESET_IN_N pin should be connected to a control mechanism on the host platform, such as a button, switch, or jumper. It should be an open-drain or open-collector connection to ground.",
        "detailed_description":"The RESET_IN_N pin is an input signal used to reset the Semtech RC76xx module. A low level pulse applied to this pin will immediately restart the module. This reset action affects the CPU registers and RAM memory for the next power-on cycle. It is intended for emergency situations where the module may become unresponsive.",
        "functionality":"This pin can be used for both a standard reset and an emergency power-off function. A short low pulse initiates a reset. Holding the pin low for an extended duration (at least 8 seconds) while POWER_ON_N is de-asserted results in an emergency power-off.",
        "precautions":[
          "Do not design any external pull-up circuit on this pin to avoid damage or abnormal reset signals.",
          "This pin should only be used for emergencies if the system freezes (not responding to commands).",
          "Using RESET_IN_N inappropriately can lead to memory corruption; it is recommended to use a power cycle instead when possible.",
          "When using RESET_IN_N for an emergency power off, ensure POWER_ON_N is de-asserted.",
          "If the module is in PSM, asserting RESET_IN_N will wake it up and perform a reset."
        ]
      },
      "internal_pull":{
        "direction":"UP",
        "pull_value":{
          "nom":40,
          "units":"kΩ"
        }
      },
      "name":"RESET_IN_N",
      "pin_id":"11",
      "type":"DIGITAL"
    },
    "RESET_OUT_N":{
      "description":"Reset output signal",
      "direction":"OUTPUT",
      "group":"Control\nSignal",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"This pin is typically connected to the reset input of peripheral devices such as USB hubs, I2C devices, etc.",
        "connectivity":"It is an output pin from the module.",
        "detailed_description":"This pin can be used to provide a signal that will hold peripheral devices (such as a USB hub, I2C device, etc.) in reset until the power-up sequence is complete.",
        "functionality":"When the module is:\n* In reset or powering up—this pin is held low to put peripheral devices in reset. Once the power-on sequence is complete, this pin will be turned high to take the peripherals out from reset.\n* In PSM—this pin will keep its previous status.",
        "precautions":"This pin is controlled by GPIO6. To configure this pin as a Reset output:\n1. Disable external SIM switch feature using AT!CUSTOM=\"EXTUIMSWITCHEN\",0.\n2. Configure GPIO6 using AT+WIOCFG=6,0.\n3. Reboot the module.\nFor details, refer to the Semtech RC76xx AT Command Reference guide."
      },
      "name":"RESET_OUT_N",
      "pin_id":"46",
      "type":"DIGITAL"
    },
    "RF_DIV":{
      "description":"Diversity Antenna Interface",
      "direction":"INPUT",
      "group":"RF",
      "if_unused":"Mandatory connection",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Diversity Antenna",
            "details":"An external antenna specifically designed for diversity reception is required. This antenna should be connected to the RF_DIV pin. The antenna's characteristics, such as impedance and frequency range, should be compatible with the module's specifications and the cellular bands being used."
          },
          {
            "component_name":"Ground Plane",
            "details":"The RF_DIV pin is associated with ground pads (Pin 30 and Pin 32) which must be connected to the module's ground plane for proper RF signal integrity and shielding."
          }
        ],
        "connectivity":"The RF_DIV pin should be connected to the diversity antenna. It is an input pin to the module.",
        "detailed_description":"The RF_DIV pin is the Diversity Antenna Interface. It is used for receiving signals to improve reception quality by using a second antenna to capture signals that may be missed by the primary antenna.",
        "functionality":"This pin serves as the input for the diversity antenna, which is used in conjunction with the primary antenna (RF_MAIN) to improve the module's reception capabilities through antenna diversity.",
        "precautions":[
          "The RF_DIV pin, along with its associated ground pins, must be connected to the diversity antenna. This connection is crucial for enabling antenna diversity functionality.",
          "Proper routing of the RF trace for RF_DIV is recommended to maintain signal integrity. Refer to Section 5.7.3 'RF Routing Recommendations' for detailed guidelines.",
          "The antenna system, including the diversity antenna connected to RF_DIV, should meet the recommendations outlined in Table 3-30 'Antenna Recommendations', particularly regarding VSWR, total radiated efficiency, and isolation between antennas."
        ]
      },
      "name":"RF_DIV",
      "pin_id":"31",
      "type":"ANALOG"
    },
    "RF_GNSS":{
      "description":"GNSS Antenna Interface",
      "direction":"INPUT",
      "group":"RF",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"GNSS Antenna",
            "description":"The antenna must be designed to operate within the GNSS frequency bands (typically around 1575.42 MHz for GPS L1, and other frequencies for GLONASS, BeiDou, Galileo). Recommendations for antenna characteristics such as frequency range, field of view, gain, and polarization are provided in the datasheet (Table 3-33)."
          },
          {
            "component_name":"Ground Planes",
            "description":"The RF_GNSS pin should be connected to ground planes (pins 37 and 39) for proper RF signal integrity and shielding, as indicated in the datasheet."
          }
        ],
        "connectivity":"The RF_GNSS pin should be connected to a GNSS antenna.  It is recommended to follow specific routing guidelines for RF signals to ensure optimal performance.",
        "detailed_description":"The RF_GNSS pin is the radio frequency input for the Global Navigation Satellite System (GNSS) receiver. It allows the module to receive signals from GNSS satellites for location determination.",
        "functionality":"This pin serves as the primary interface for the GNSS antenna. Its functionality is solely dedicated to receiving GNSS RF signals.",
        "precautions":[
          "RF_GNSS is an input pin and therefore susceptible to ESD. ESD protection should be implemented on this line, especially if the antenna is externally accessible. Refer to section 5.9 EMC and ESD Recommendations and Table 5-1 for ESD specifications.",
          "The routing of the RF_GNSS trace requires careful consideration to maintain signal integrity and minimize losses. It is recommended to use a Conductor-Backed Coplanar Waveguide (CBCPW) and follow the routing constraints detailed in section 5.7.3 RF Routing Recommendations.",
          "The datasheet specifies that the maximum voltage applied to antenna interface pins should not exceed 6.3 VDC.",
          "Ensure that the antenna system provides adequate isolation (> 20 dB) between the GNSS antenna and any WWAN antennas to prevent interference."
        ]
      },
      "name":"RF_GNSS",
      "pin_id":"38",
      "type":"ANALOG"
    },
    "RF_MAIN":{
      "description":"Primary Antenna Interface",
      "direction":"BIDIRECTIONAL",
      "group":"RF",
      "if_unused":"Mandatory connection",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Primary WWAN Antenna",
            "details":"The RF_MAIN pin connects to the primary antenna responsible for transmitting and receiving cellular signals. The antenna should be selected based on the supported frequency bands and performance requirements."
          },
          {
            "component_name":"Ground (GND) Pins",
            "details":"Multiple GND pins (e.g., Pin 48, Pin 50, Pin 136, Pin 139) are recommended to be connected to the RF_MAIN pin's ground connection. This ensures a solid RF ground reference and aids in signal integrity and thermal dissipation."
          },
          {
            "component_name":"RF Transmission Line",
            "details":"A controlled impedance transmission line (e.g., microstrip or coplanar waveguide) should be used to connect the RF_MAIN pin to the antenna. The impedance should typically be 50 Ohms."
          }
        ],
        "connectivity":"This pin must be connected to the primary WWAN antenna through a suitable RF transmission line. It should also be connected to Ground (GND) pins for proper RF grounding.",
        "detailed_description":"The RF_MAIN pin is the primary interface for the module's radio frequency (RF) signals. It serves as both an input for receiving RF signals and an output for transmitting RF signals.",
        "functionality":"This pin is the main antenna interface for the module, connecting to the primary WWAN antenna. It is used for both transmitting and receiving RF signals across various cellular technologies supported by the module (LTE, UMTS, GSM/GPRS/EDGE).",
        "precautions":[
          "RF Routing: The trace connected to RF_MAIN must be routed according to RF routing recommendations to maintain signal integrity and minimize losses. This includes using controlled impedance traces and proper grounding.",
          "Grounding: Ensure adequate grounding for the RF_MAIN pin by connecting it to multiple GND pads and ground planes.",
          "Signal Integrity: Avoid routing other signals near the RF_MAIN trace to prevent interference and signal degradation.",
          "Antenna Selection: The choice of antenna and its placement are critical for RF performance. Ensure the antenna is compatible with the module's supported frequency bands and meets VSWR and efficiency requirements.",
          "ESD Protection: While not explicitly stated for this pin, it is good practice to consider ESD protection for RF interfaces, especially if exposed to user contact or harsh environments. Consult EMC and ESD Recommendations in Section 5.9.",
          "Maximum Voltage: Do not exceed the maximum voltage applied to antenna interface pins, which is 6.3 VDC as per Table 3-34."
        ]
      },
      "name":"RF_MAIN",
      "pin_id":"49",
      "type":"ANALOG"
    },
    "SAFE_PWR_REMOVE":{
      "description":"Indicate to host\nthat Main DC power\ncan be removed",
      "direction":"OUTPUT",
      "group":"Indication",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"This pin is intended to be connected to the host system's power management circuitry or a microcontroller's GPIO pin that controls the VBATT supply.",
        "connectivity":"This pin is an output from the RC76xx module and should be connected to the host system's power management or control logic. The host system should monitor this signal to determine when it is safe to remove power from the module. It is recommended that all host interfaces connected to the module be disabled (set to high impedance or pull-down) before VBATT is switched off.",
        "detailed_description":"The SAFE_PWR_REMOVE signal is an output from the Semtech RC76xx module that indicates to the host device that the main power supply (VBATT) can be safely turned off.",
        "functionality":"This signal provides a positive pulse to signal to the host that it is safe to remove the main power supply (VBATT). The pulse width is approximately 13.26 ms. After this pulse, there is a delay of 7.8 ms from the falling edge of SAFE_PWR_REMOVE to VGPIO turning off.",
        "precautions":"The host system must monitor this signal before removing VBATT. It is also important to consider the VGPIO discharge time (which depends on the load on the host equipment) before switching off VBATT. All host interfaces connected to the module should be disabled before VBATT is switched off to prevent leakages and ensure proper power-on sequences."
      },
      "name":"SAFE_PWR_REMOVE",
      "pin_id":"152",
      "type":"DIGITAL"
    },
    "SLEEP_CLK":{
      "description":"32.768 kHz digital clock output",
      "direction":"OUTPUT",
      "group":"Clock",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_description":"An external microcontroller or other peripheral device that requires a low-frequency clock signal for its operation (e.g., for real-time clock functions, low-power timing, or maintaining system state during module sleep periods).",
            "component_name":"External Microcontroller/Peripheral"
          },
          {
            "component_description":"A small decoupling capacitor (e.g., 0.1 uF) may be placed in parallel with the connection to ground to help filter any high-frequency noise, although this is typically not strictly necessary for a low-frequency clock output.",
            "component_name":"Decoupling Capacitor (Optional)"
          }
        ],
        "connectivity":"The SLEEP_CLK pin should be connected to the clock input of any external component requiring a low-frequency clock signal. The connection should be made via a signal trace. No external pull-up or pull-down resistors are typically required for this output pin.",
        "detailed_description":"The SLEEP_CLK pin provides a 32.768 kHz digital clock output from the module. This clock signal is derived from an internal real-time clock.",
        "functionality":"The primary function of SLEEP_CLK is to provide a low-frequency clock signal. It is typically used for low-power timing or real-time clock functions in external circuitry when the main module is in a low-power state. It is not a wakeable pin.",
        "precautions":[
          "The SLEEP_CLK pin is an output and should not be driven by external circuitry to avoid potential damage to the module.",
          "While typically not required, ensure proper trace routing for signal integrity, especially if the trace is long or routed near noisy signals.",
          "If the pin is not used, it should be left unconnected ('Leave open') as per the datasheet recommendations to avoid any potential interference or unexpected behavior."
        ]
      },
      "io_type":"1.8V",
      "name":"SLEEP_CLK",
      "pin_id":"23",
      "type":"DIGITAL"
    },
    "SPI1_CLK":{
      "description":"SPI serial clock\n(output from Master)",
      "direction":"OUTPUT",
      "group":"SPI1",
      "implementation":{
        "connected_components":[
          {
            "component_description":"Any SPI-compatible slave device that requires a clock signal for serial communication. This could include sensors, memory devices, or other microcontrollers configured as SPI slaves.",
            "component_name":"SPI Slave Device"
          }
        ],
        "connectivity":"SPI1_CLK should be connected to the CLK (or SCLK) input of the SPI slave device.",
        "detailed_description":"SPI1_CLK is the serial clock signal for the SPI1 bus. It is output from the master (the Semtech RC76xx module) and controls the timing of data transfer on the MOSI and MISO lines.",
        "functionality":"This pin serves as the serial clock output for the SPI1 bus. It is used in master mode operation for the Semtech RC76xx module to synchronize data transfer with a connected SPI slave device. The clock frequency can range up to 38 MHz.",
        "precautions":[
          "Ensure the SPI clock speed does not exceed the capabilities of the connected SPI slave device.",
          "Maintain signal integrity for the clock signal, especially at higher frequencies, by following PCB layout recommendations for high-speed signals.",
          "The pin has an output capability and should not be driven externally when the module is acting as a master."
        ]
      },
      "name":"SPI1_CLK",
      "pin_id":"53",
      "type":"DIGITAL"
    },
    "SPI1_MISO":{
      "description":"SPI Master Input/Slave Output\n(output from slave)",
      "direction":"INPUT",
      "group":"SPI1",
      "implementation":{
        "connected_components":"The SPI1_MISO pin needs to be connected to the MOSI pin of the SPI slave device that the RC76xx module is communicating with. The specific nature of the slave device would depend on the application.",
        "connectivity":"In a schematic, SPI1_MISO should be connected to the MOSI (Master Output / Slave Input) pin of the connected SPI slave device.  The RC76xx module acts as the master in this scenario.",
        "detailed_description":"SPI1_MISO is the Master Input / Slave Output pin for the SPI1 bus. In the context of the RC76xx module, it functions as the data output from the slave device when the module is operating as a master in SPI communication.",
        "functionality":"This pin serves as the Master Input / Slave Output for the SPI1 bus. It's used by the RC76xx module when it acts as an SPI master to receive data from a connected SPI slave device.",
        "precautions":"The RC76xx module operates as an SPI master on this bus. Ensure that the connected slave device is configured correctly to communicate with the master. The default state of this pin when unused is 'Leave open'."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"SPI1_MISO",
      "pin_id":"52",
      "type":"DIGITAL"
    },
    "SPI1_MOSI":{
      "description":"SPI Master Output/Slave Input (output\nfrom master)",
      "direction":"OUTPUT",
      "group":"SPI1",
      "implementation":{
        "connected_components":[
          {
            "component_name":"SPI Slave Device",
            "connection_details":"Connect directly to the MOSI (Master Out Slave In) pin of the SPI Slave device. Ensure proper impedance matching and trace routing as per the datasheet's recommendations for high-speed digital signals."
          }
        ],
        "connectivity":"In a schematic where the RC76xx module is the SPI Master, the SPI1_MOSI pin should be connected to the MOSI (Master Out Slave In) pin of the SPI Slave device. This creates the data transmission path from the module to the slave device. The connection should be a direct trace on the PCB, ideally with impedance matching considerations if operating at higher speeds or over longer distances, as per the datasheet's RF Routing Recommendations, though SPI is a digital interface.",
        "detailed_description":"SPI1_MOSI (Master Output, Slave Input) is a serial data line used in the SPI (Serial Peripheral Interface) communication protocol. When the RC76xx module acts as the SPI Master, this pin transmits data to the SPI Slave device. Conversely, when the module is configured as an SPI Slave (though not supported in Master mode operation by this module), it would receive data from the SPI Master on this pin.",
        "functionality":"When the RC76xx is acting as an SPI Master, SPI1_MOSI serves as an output pin to transmit data to the connected SPI Slave device. The data transmitted is determined by the SPI communication being performed. While the module itself operates in Master mode, the pin's designation as 'Master Output/Slave Input' highlights its role in the SPI bus. It is not designed to be a general-purpose input/output pin when used as part of the SPI interface.",
        "precautions":[
          "The SPI1_MOSI pin is specifically for SPI communication and should not be used as a general-purpose I/O pin when the SPI interface is active.",
          "Ensure proper impedance matching for the trace connecting SPI1_MOSI to the SPI slave, especially for longer trace lengths or higher SPI clock frequencies, to maintain signal integrity.",
          "Refer to the datasheet's routing recommendations for high-speed digital signals, particularly regarding ground planes and trace separation, to minimize noise and interference."
        ]
      },
      "name":"SPI1_MOSI",
      "pin_id":"54",
      "type":"DIGITAL"
    },
    "SPI1_MRDY":{
      "description":"SPI Master Ready",
      "direction":"OUTPUT",
      "group":"SPI1",
      "implementation":{
        "connected_components":[
          {
            "component_name":"SPI Slave Device / Host Microcontroller",
            "connection_description":"Connected to the SPI1_MRDY output of the RC76xx module. The specific function of the connected pin on the slave device or microcontroller would depend on how it's designed to interpret the 'Master Ready' signal from the RC76xx. This could be an interrupt input, a status check input, or a general-purpose input."
          }
        ],
        "connectivity":"This pin should be connected as an output from the Semtech RC76xx module. In a schematic, it would be an output pin from the module that connects to a corresponding input or control pin on the SPI slave device or the host system's microcontroller that is managing the SPI communication.",
        "detailed_description":"SPI1_MRDY (SPI Master Ready) is an output signal from the Semtech RC76xx module related to the SPI bus interface. In the context of SPI communication, this signal likely indicates the readiness of the SPI master (the RC76xx module) to engage in communication or to signal a specific state regarding its readiness.",
        "functionality":"This pin serves as an output signal indicating the SPI master's readiness. Its specific behavior (e.g., active low or high, pulsed or continuous) would depend on the SPI protocol implementation and how it's configured via AT commands. It is part of the SPI1 interface.",
        "precautions":[
          "The pin is an output and should not be driven externally. The RC76xx module controls its state.",
          "Ensure proper signal routing for SPI communication to maintain signal integrity, as described in Section 5.7.3 RF Routing Recommendations and Section 5.7.4 USB Interface of the datasheet.",
          "The default state of this pin is 'Internal Pull-Down' in active status.",
          "Refer to the RC76xx AT Command Reference for any specific configuration commands related to SPI functionality, such as `AT!CUSTOM` or `+WIOCFG` if applicable to SPI behavior."
        ]
      },
      "name":"SPI1_MRDY",
      "pin_id":"51",
      "type":"DIGITAL"
    },
    "SYS_CLK":{
      "description":"19.2 MHz digital clock output",
      "direction":"OUTPUT",
      "group":"Clock",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_function":"Receives the system clock signal from SYS_CLK to synchronize its operations.",
            "component_name":"Host Microcontroller/Processor",
            "connection_details":"Connected to a clock input pin of the host's main processing unit."
          },
          {
            "component_function":"May utilize the SYS_CLK signal for their timing or synchronization needs.",
            "component_name":"Other Peripherals",
            "connection_details":"Connected to the clock input of any peripheral device requiring this clock signal."
          }
        ],
        "connectivity":"The SYS_CLK pin should be connected to the clock input of the host system's microcontroller, processor, or any other peripheral requiring a system clock signal. A direct connection is recommended.",
        "detailed_description":"The SYS_CLK pin is a digital clock output signal provided by the module's Power Management Integrated Circuit (PMIC). It outputs a stable 19.2 MHz clock signal. This signal is intended for use by the host system or other connected peripherals that require a system clock reference.",
        "functionality":"This pin serves a single primary function: to provide a 19.2 MHz system clock output. It is not described as having different functions based on connectivity.",
        "precautions":[
          "The SYS_CLK signal should not be loaded with more than the specified drive capability to avoid signal degradation.",
          "Avoid routing the SYS_CLK trace near sensitive analog signals or RF traces to prevent noise injection or interference.",
          "Ensure the trace length for SYS_CLK is kept as short as possible to minimize signal integrity issues and impedance mismatches.",
          "The SYS_CLK pin is an output and should not be driven by external circuitry."
        ]
      },
      "io_type":"1.8V",
      "name":"SYS_CLK",
      "pin_id":"22",
      "type":"DIGITAL"
    },
    "TP1 (Boot pin)":{
      "description":"Test point 1\n0—Download\nmode\nOpen—Normal\nmode",
      "direction":"INPUT",
      "group":"Control\nSignal",
      "if_unused":"Mandatory test point",
      "implementation":{
        "connected_components":"When used for boot-loader mode: a button, switch, or jumper. When used for testing: a test point.",
        "connectivity":"If used to force boot-loader mode, it should be connected to a control mechanism (button, switch, or jumper) that asserts the pin low during power-up. If not used for boot-loader mode, it should be connected to a test point.",
        "detailed_description":"The TP1 pin (boot pin) is used to force the module to enter boot-loader mode on power-up. When the module is not connected to a control mechanism, it should be connected to a test point for RMA and debug purposes.",
        "functionality":"The pin has two primary functions: \n1. Force the module into boot-loader mode on power-up by connecting it to a control mechanism (e.g., button, switch, or jumper) and asserting it low.\n2. Serve as a test point for RMA and debug purposes if not connected to a control mechanism.",
        "precautions":"If forcing boot-loader mode, ensure the TP1 pin is de-asserted after the module restarts and enters boot-loader mode. If the pin is not connected to a control mechanism, it must be connected to a test point for RMA and debug. Firmware downloads can also occur over USB or OTA."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"TP1 (Boot pin)",
      "pin_id":"47",
      "type":"DIGITAL"
    },
    "TX_ON":{
      "description":"Tx activity indicator",
      "direction":"OUTPUT",
      "group":"Indication",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"The datasheet indicates that this pin can be connected to the host system or external circuitry that needs to monitor transmit activity.",
        "connectivity":"The TX_ON pin is an output from the module. It should be connected to a host system or external circuitry that needs to be notified of transmit activity. The datasheet suggests it is an 'Indication' pin.",
        "detailed_description":"The TX_ON pin is a digital output signal provided by the Semtech RC76xx module that indicates the occurrence of Transmit (Tx) activity. When the module is actively transmitting, this signal goes high. When there is no transmission activity, the signal goes low.",
        "functionality":"The primary function of the TX_ON pin is to signal transmit activity. It does not appear to serve different functions based on connectivity in the provided datasheet excerpt.",
        "precautions":"The datasheet provides timing characteristics for the TX_ON signal (Tadvance and Tdelay), which may be relevant for precise synchronization with external components. Specifically, the advance time is 64.8 ms (LTE) / 20 ms (3G) / 150 µs (2G) and the delay is up to 33.8 ms (LTE) / 800 ms (3G) / 50 µs (2G). It is important to consider these timing parameters when integrating this signal with other components to ensure proper synchronization."
      },
      "io_type":"1.8V",
      "name":"TX_ON",
      "pin_id":"60",
      "type":"DIGITAL"
    },
    "UART1_CTS":{
      "description":"Clear To Send,\nFlow Control",
      "direction":"OUTPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "connection_description":"Connect to the CTS (Clear To Send) input pin of the host device's UART controller.",
            "name":"Host Device"
          }
        ],
        "connectivity":"UART1_CTS should be connected from the module's pin to the corresponding CTS (Clear To Send) input pin on the host device.",
        "detailed_description":"UART1_CTS is the Clear To Send signal for the UART1 interface, used for flow control in serial communication. It indicates to the transmitting device that the receiving device is ready to receive data.",
        "functionality":"The primary function of UART1_CTS is to serve as a flow control signal for the UART1 interface. It is an output from the module to the host.",
        "precautions":[
          "It is highly recommended to connect this pin for flow control.",
          "The signal direction is an output from the module to the host.",
          "The pin has a default state of Pull Down in active status.",
          "It is recommended to reserve a pull-up resistor design on UART1_TX and UART1_RX pins, with a typical value of 100k Ohm, if there is no pull-up setting on the host side or to avoid unclear signal levels when the host is in low power mode. This value depends on the application and used hardware."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_CTS",
      "pin_id":"4",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_DCD":{
      "description":"Data Carrier Detect\nSignal data\nconnection in\nprogress",
      "direction":"OUTPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"An external pull-down resistor (value to be determined based on application specifics, typically in the kOhm range) is recommended to ensure a defined low state when the module is not actively indicating data carrier detection. The module itself drives this pin.",
        "connectivity":"It is connected as an output from the module. For robust signal integrity and to prevent potential boot issues if the pin is pulled high unexpectedly, it is highly recommended to install an external pull-down resistor on this pin when the UART interface is used.",
        "detailed_description":"The UART1_DCD (Data Carrier Detect) signal is an output from the module that indicates the status of the data connection. When a data connection is active, this signal is asserted.",
        "functionality":"The pin's primary function is to indicate the presence of a data carrier. It is an output signal from the module.",
        "precautions":"It is critical NOT to install an external pull-up resistor on this pin. Doing so can prevent the module from booting correctly. Ensure the pin is properly pulled down when not actively indicating data carrier detect. The pin is internally pulled down by default."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_DCD",
      "pin_id":"8",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_DSR":{
      "description":"Data Set Ready\nSignal UART\ninterface is ON",
      "direction":"OUTPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Device UART Controller",
            "connection_details":"Connected to the DSR input/output of the host's UART controller."
          },
          {
            "component_name":"Internal Pull-down Resistor",
            "connection_details":"An internal pull-down resistor is present on the pin."
          }
        ],
        "connectivity":"The pin should be connected to the host device's corresponding DSR signal.  There is a strong recommendation for a mandatory connection if the UART interface is used.  Additionally, the pin has an internal pull-down resistor.",
        "detailed_description":"UART1_DSR (Data Set Ready) is an output signal from the module that indicates the status of the UART interface. Specifically, it signals that the UART interface is ON and ready for communication.",
        "functionality":"The primary function of UART1_DSR is to indicate that the UART interface is ready.  However, the pin has specific notes regarding its default state and potential boot issues if not handled correctly.  It is internally pulled down, and there's a warning against installing an external pull-up resistor, as this could prevent the module from booting.  Additionally, the pin's behavior regarding wake-up from sleep mode is mentioned, noting it will pull up if KSLEEP is set to 1 or 2, and float if KSLEEP is 0. This suggests a secondary conditional functionality related to power states.",
        "precautions":[
          "Do not install an external pull-up resistor on this pin, otherwise the module will not boot.",
          "The pin should be connected if the UART interface is used.",
          "The pin's behavior regarding wake-up from sleep mode depends on the KSLEEP setting, which should be considered in the system design."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_DSR",
      "pin_id":"9",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_DTR":{
      "description":"Data terminal\nready\nPrevents the\nRC76xx from\nentering sleep\nmode, switches\nbetween data\nmode and\ncommand mode,\nand wakes the\nmodule.",
      "direction":"INPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"The pin is connected to the host system's UART interface. Depending on the host's power management strategy, it might be connected to a host system's power management controller or a dedicated signal. If used for wake-up, it would be connected to a GPIO or other controllable output pin on the host.  A pull-down resistor is mentioned as a default state for the pin when unused, but specific connection details depend on the host implementation.",
        "connectivity":"This pin should be connected as an input to the module. The connection strategy from the host depends on the desired behavior regarding sleep mode and wake-up events. For wake-up functionality, it should be connected to a host signal that can transition its state.",
        "detailed_description":"The UART1_DTR (Data Terminal Ready) signal is an input to the module that is used to manage the data terminal ready status. It can prevent the RC76xx from entering sleep mode, switch between data mode and command mode, and wake up the module. The pin's behavior regarding sleep mode is dependent on the KSLEEP setting.",
        "functionality":"This pin can serve multiple functions: preventing the module from entering sleep mode, switching between data and command modes, and waking the module. Its behavior related to sleep mode is influenced by the KSLEEP setting, where it will be floating when KSLEEP=0 and pull-up when KSLEEP=1 or 2.",
        "precautions":"The pin is described as 'wakeable', meaning it can trigger the module to wake up from sleep mode. When the module is in PSM, this pin is not a recognized wakeup source.  Additionally, the pin's behavior regarding sleep mode is dependent on the KSLEEP setting. If the host side has no pull-up setting or is in a low power mode, it's recommended to reserve a pull-up resistor design on the UART1_RX and UART1_TX pins, which might indirectly influence the overall UART interface design. The default state of the pin is a pull-down."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_DTR",
      "pin_id":"7",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_RI":{
      "description":"Ring Indicator\nSignal incoming\ncalls (voice and\ndata), SMS, etc.",
      "direction":"OUTPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Device Input",
            "description":"An input pin on the host device designed to receive the Ring Indicator signal, typically an interrupt input."
          },
          {
            "component_name":"Pull-down Resistor",
            "description":"A resistor connected between the UART1_RI pin and ground. Its value is typically selected to ensure a low logic level when the module is in its reset or boot state."
          }
        ],
        "connectivity":"The UART1_RI pin should be connected to an input on the host device that can detect a low-level pulse. It is also recommended to have a pull-down resistor on this pin, which is the default reset state. An external pull-up resistor should NOT be installed on this pin, as it can prevent the module from booting.",
        "detailed_description":"The UART1_RI pin is an output signal from the module that functions as a Ring Indicator. It is used to notify an external application about various events, such as incoming calls (voice and data), incoming SMS messages, or timer expirations. The module pulses this signal low when such an event occurs.",
        "functionality":"The UART1_RI pin can be used independently from the main UART1 interface. Its behavior, specifically the pulse width, can be configured using the AT+WRID command. It also supports events that toggle the RI signal and can be configured as a wakeup source for the module from a sleep state using the AT+WWAKESET AT command.",
        "precautions":[
          "Do not install an external pull-up resistor on this pin, as it can prevent the module from booting.",
          "The pulse width of the signal can be configured using the AT+WRID AT command.",
          "The signal can be used to wake the module from a sleep state if configured via the AT+WWAKESET AT command.",
          "The pin has an internal pull-down resistor."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_RI",
      "pin_id":"2",
      "polarity":"ACTIVE_LOW",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_RTS":{
      "description":"Ready To Send,\nFlow Control",
      "direction":"INPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host UART Controller",
            "connection_details":"Connect the UART1_RTS pin of the module to the RTS input pin of the host's UART controller."
          },
          {
            "component_name":"Pull-down Resistor (optional, but recommended)",
            "connection_details":"Although the pin has an internal pull-down, an external pull-down resistor can be added for robustness.  The default state is pulled down, and it is asserted (driven low) by the module when ready to receive."
          }
        ],
        "connectivity":"UART1_RTS should be connected to the RTS (Ready To Send) input pin of the host UART controller.  It is a unidirectional signal originating from the module.",
        "detailed_description":"UART1_RTS (Ready To Send) is a flow control signal for the UART1 interface. It indicates to the connected device (e.g., host processor) whether the module is ready to receive data.",
        "functionality":"UART1_RTS is an output signal from the module. When the module is ready to receive data from the host, it asserts this signal (typically by driving it low). When the module is not ready (e.g., its receive buffer is full), it de-asserts this signal (typically by letting it float or pulling it down). This allows the connected device to pause transmission to avoid data overflow.",
        "precautions":[
          "Highly Recommended to connect for proper flow control.",
          "The pin has an internal pull-down resistor, but an external pull-down is recommended for robust operation.",
          "Ensure the host UART controller's RTS input is correctly configured to interpret the signal from the module."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_RTS",
      "pin_id":"3",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_RX":{
      "description":"Receive Data",
      "direction":"OUTPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_description":"The transmit pin of the host's Universal Asynchronous Receiver-Transmitter interface.",
            "component_name":"Host UART Interface TX pin"
          },
          {
            "component_description":"A resistor (typically 100 kΩ) connected between the UART1_RX pin and VGPIO, used to ensure a defined signal level when the host is in low power mode or lacks its own pull-up.",
            "component_name":"Pull-up resistor"
          },
          {
            "component_description":"Used to connect the UART1_RX pin to a test point for debug and diagnostic purposes.",
            "component_name":"0 ohm resistor"
          }
        ],
        "connectivity":"The UART1_RX pin should be connected to the transmit (TX) pin of the host UART interface. It is recommended to reserve a pull-up resistor (typically 100 kΩ) on this pin if the host side does not have a pull-up setting or to avoid unclear signal levels when the host is in low power mode. The pin should be connected through a 0 ohm resistor if it needs to be accessible via test points.",
        "detailed_description":"UART1_RX is the receive data signal for the primary UART interface. It is used for data communication between the module and a host processor or PC. The signal is an output from the module to the host.",
        "functionality":"The pin serves as the primary UART receive data line. It is used for transmitting data from the module to the host. It can also be configured to wake the module from sleep mode when a specific signal level transition occurs.",
        "precautions":[
          "If the host side does not have a pull-up setting, or to avoid unclear signal levels when the host is in low power mode, it is recommended to reserve a pull-up resistor (typically 100 kΩ) on this pin.",
          "The pin is 'wakeable', meaning it can trigger the module to wake up from sleep mode. Ensure this behavior is managed appropriately in the application design.",
          "When the module is in reset or powering down, it is recommended to place the UART1_RX pin in a high impedance state or floating.",
          "Do not install an external pull-up resistor on this pin if the module is intended to boot correctly, as it can cause boot issues.",
          "This signal is named with respect to the host device. The direction listed (output) is with respect to the module."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_RX",
      "pin_id":"6",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART1_TX":{
      "description":"Transmit Data",
      "direction":"INPUT",
      "group":"UART1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host UART Interface",
            "connection":"RX pin"
          },
          {
            "component_name":"Pull-up resistor",
            "connection":"Connected between UART1_TX and VGPIO (1.8V). A typical value is 100 kΩ. This is recommended if there is no pull-up setting on the host side, or to avoid unclear signal levels when the host is in low power mode."
          }
        ],
        "connectivity":"Connect to the RX pin of the UART interface on the host device.",
        "detailed_description":"UART1_TX is a transmit data pin for the primary UART interface. This interface is used for data communication between the module and a PC or host processor. It complies with the RS-232 interface.",
        "functionality":"This pin serves as the transmit data output for the primary UART interface (UART1).",
        "precautions":[
          "It is recommended to reserve a pull-up resistor design on UART1_TX. The typical resistor value is 100 kΩ. This value depends on the application and used hardware.",
          "UART signals are named with respect to the host device, and directions are listed with respect to the module. Therefore, UART1_TX is an input to the module from the host.",
          "If the host side does not have a pull-up setting, or to avoid any unclear signal level when the host side is in low power mode, it is recommended to reserve a pull-up resistor design on UART1_TX and UART1_RX pins."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART1_TX",
      "pin_id":"5",
      "reset_state":"Pull Down",
      "type":"DIGITAL"
    },
    "UART2_CTS":{
      "description":"UART2 Clear To\nSend",
      "direction":"OUTPUT",
      "group":"UART2",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"The primary component to be connected is the host device's UART2 interface, specifically its RTS (Request To Send) pin. The document also suggests a pull-down resistor might be used, though it's not explicitly listed as a 'connected component' but rather a characteristic of the pin's behavior if unused.",
        "connectivity":"The UART2_CTS pin should be connected to the UART2_RTS (Request To Send) pin of the host device. A highly recommended connection is implied for flow control.",
        "detailed_description":"UART2_CTS (Clear To Send) is an output signal from the module that functions as a flow control signal for the UART2 interface. It indicates when the module is ready to receive data.",
        "functionality":"The pin's primary function is as a flow control signal (Clear To Send) for the UART2 interface. It is also designated as an Extension type pin, indicating it provides additional capabilities beyond core functions.",
        "precautions":"The connection is described as 'Highly Recommended', implying that proper implementation of flow control via this pin is important for reliable UART communication. If the pin is left unused, it has a pull-down state in reset and active normal mode."
      },
      "name":"UART2_CTS",
      "pin_id":"99",
      "type":"DIGITAL"
    },
    "UART2_RTS":{
      "description":"UART2 Request To\nSend",
      "direction":"INPUT",
      "group":"UART2",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Device",
            "connection":"Connect UART2_RTS on the module to the RTS pin on the host device."
          },
          {
            "component_name":"Pull-up Resistor",
            "connection":"Optional, connected between the UART2_RTS pin and VDD_IO (1.8V) on the host side if needed for signal integrity or low power scenarios. Typical value is 100k Ohm."
          }
        ],
        "connectivity":"Connect this pin to the corresponding RTS pin on the host device. It is recommended to reserve a pull-up resistor on this pin on the host side if there is no pull-up setting, or to avoid unclear signal levels when the host is in low power mode. The typical resistor value is 100k Ohm, but this depends on the application and hardware used. It is also recommended to keep this pin accessible through a 0 ohm resistor and have a test point at the module side.",
        "detailed_description":"UART2_RTS (Request To Send) is a signal used for flow control in serial communication. It is an output from the module to the host, indicating that the module is ready to send data.",
        "functionality":"Primarily used for flow control in UART2 serial communication. It is an output signal from the module, indicating its readiness to transmit data.",
        "precautions":[
          "It is recommended to reserve a pull-up resistor on this pin on the host side if there is no pull-up setting, or to avoid unclear signal levels when the host is in low power mode. The typical resistor value is 100k Ohm, but this depends on the application and hardware used.",
          "It is recommended to keep this pin accessible through a 0 ohm resistor and have a test point at the module side for potential debugging or testing."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART2_RTS",
      "pin_id":"98",
      "type":"DIGITAL"
    },
    "UART2_RX":{
      "description":"UART2 Receive\ndata",
      "direction":"OUTPUT",
      "group":"UART2",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_description":"The transmit pin of the host's UART interface, which will send data to the module's UART2_RX.",
            "component_name":"Host UART Transmit (TX) pin"
          },
          {
            "component_description":"If the host UART voltage levels differ from the module's 1.8V logic, a level shifter is recommended to ensure proper signal compatibility.",
            "component_name":"Level Shifter (optional)"
          }
        ],
        "connectivity":"UART2_RX should be connected to the transmit data line (UART2_TX) of the host device or debug interface. It is recommended to connect it via a level shifter if the host device's UART voltage levels are different from the module's 1.8V logic.",
        "detailed_description":"UART2_RX is the receive data line for the secondary UART interface. This interface is primarily for internal Semtech debug purposes.",
        "functionality":"The primary function of UART2_RX is to receive data. Its usage is generally restricted to internal debug operations. In some contexts, it might be configured as a general purpose I/O, but this is not its primary or recommended use.",
        "precautions":[
          "This pin is primarily for internal Semtech debug and not intended for general customer use. Use with caution.",
          "Ensure proper voltage level translation if connecting to a host UART operating at different voltage levels.",
          "When not in use, it is recommended to leave this pin unconnected to avoid unintended behavior."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART2_RX",
      "pin_id":"97",
      "type":"DIGITAL"
    },
    "UART2_TX":{
      "description":"UART2 Transmit\ndata",
      "direction":"INPUT",
      "group":"UART2",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Device / Debug Equipment",
            "connection_details":"Connect to the RX pin of the UART interface on the host device or debug equipment."
          },
          {
            "component_name":"Pull-down Resistor",
            "connection_details":"A pull-down resistor (e.g., 10 kΩ) can be connected to ground if the pin is unused to maintain a defined logic level."
          }
        ],
        "connectivity":"When used, UART2_TX should be connected to the RX pin of the corresponding UART interface on the host device or debug equipment. A pull-down resistor is recommended on this pin if it is not used, to maintain a defined logic level. If the interface is not needed, it can be left unconnected.",
        "detailed_description":"UART2_TX is a transmit data line for the secondary UART interface. This interface is primarily intended for internal Semtech debug purposes.",
        "functionality":"The primary function of UART2_TX is to transmit data for the secondary UART interface. It is intended for internal debug and is not typically exposed for general customer use. While it is listed as part of the UART2 interface, its primary use case is internal to Semtech.",
        "precautions":[
          "This pin is primarily for internal Semtech debug and may not be intended for general customer use.",
          "If not used, a pull-down resistor is recommended to ensure a defined logic level.",
          "When connecting to external equipment, ensure voltage level compatibility.",
          "Refer to the AT Command Reference guide for any specific configurations related to UART2 usage."
        ]
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UART2_TX",
      "pin_id":"96",
      "type":"DIGITAL"
    },
    "UIM1_CLK":{
      "description":"Clock",
      "direction":"OUTPUT",
      "group":"UIM1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM Card",
            "description":"The UIM Card (Subscriber Identity Module) interfaces with the module via the UIM interface, including the UIM1_CLK pin for clock synchronization."
          },
          {
            "component_name":"UIM Holder",
            "description":"A physical connector for the UIM card, which facilitates the electrical connection between the UIM card and the module."
          },
          {
            "component_name":"ESD Protection Device",
            "description":"An ESD suppressor diode array (e.g., STMicroelectronics DALC208SC6) is recommended to be placed on the UIM1_CLK line to protect against electrostatic discharge."
          },
          {
            "component_name":"Capacitor (optional)",
            "description":"A capacitor (e.g., 1nF) may be used as a placeholder for potential layout issues, connected in series with the UIM1_CLK trace."
          },
          {
            "component_name":"Resistor (optional)",
            "description":"A resistor (e.g., RCLK, typically around 15kΩ) may be used as a placeholder for potential layout issues, connected in series with the UIM1_CLK trace."
          }
        ],
        "connectivity":"UIM1_CLK should be connected directly from the module's UIM1_CLK pin to the UIM card's CLK pin. It is recommended to keep this trace as short as possible.",
        "detailed_description":"UIM1_CLK is the clock signal output from the module to the UIM card. This clock signal synchronizes the communication between the module and the UIM card, following the ISO/IEC 7816 standard.",
        "functionality":"The primary function of UIM1_CLK is to provide the clock signal for UIM communication. The frequency of this clock is controlled by the module and may vary based on the UIM standard and the module's configuration.",
        "precautions":[
          "The trace for UIM1_CLK should be kept as short as possible.",
          "ESD protection is mandatory on this pin unless an external eSIM is used or there is no physical access to the UIM.",
          "Optional series resistors and capacitors are recommended as placeholders for layout considerations.",
          "Ensure the voltage level of UIM1_CLK is compatible with the UIM card's operating voltage (1.8V or 2.85V)."
        ]
      },
      "name":"UIM1_CLK",
      "pin_id":"27",
      "type":"DIGITAL",
      "voltage":"1.8V / 2.85V"
    },
    "UIM1_DATA":{
      "description":"Data connection",
      "direction":"BIDIRECTIONAL",
      "group":"UIM1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM Card Holder/eSIM",
            "connection_details":"Connect to the DATA pin of the UIM card holder or eSIM."
          },
          {
            "component_name":"ESD Suppressor Diode Array",
            "connection_details":"Connected to UIM1_DATA for ESD protection. Example: STMicroelectronics DALC208SC6."
          },
          {
            "component_name":"Resistor RDATA",
            "connection_details":"Connected in series with a 0-ohm resistor, with a value of 15 kOhms. This is for potential layout adjustments and protection."
          }
        ],
        "connectivity":"The UIM1_DATA pin should be connected to the corresponding DATA pin on the UIM card holder or eSIM. It is also recommended to have a mandatory connection to the module's UIM1_DATA pin. Additionally, an ESD suppressor diode array and a 0-ohm resistor in series with a 15k Ohm resistor (RDATA) are recommended to be connected to this pin for protection and potential layout adjustments.",
        "detailed_description":"UIM1_DATA is the data connection for the UIM1 interface, which allows for communication with a Subscriber Identity Module (SIM) card. This bidirectional data line is part of the UIM interface, which adheres to ETSI TS 102 221 standards for SIM card communication.",
        "functionality":"This pin serves as the bidirectional data line for the UIM1 interface, facilitating the exchange of data between the module and the SIM card. It supports both sending and receiving data for SIM card operations.",
        "precautions":[
          "The UIM1_DATA trace should be routed away from the UIM1_CLK trace to minimize interference.",
          "Keep the distance between the module and the UIM holder as short as possible.",
          "All signals near the UIM holder must be ESD-protected.",
          "An ESD device specifically designed for UIM cards is recommended for this pin."
        ]
      },
      "name":"UIM1_DATA",
      "pin_id":"28",
      "type":"DIGITAL",
      "voltage":"1.8V / 2.85V"
    },
    "UIM1_RESET_N":{
      "description":"Reset",
      "direction":"OUTPUT",
      "group":"UIM1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM Card Holder",
            "connection_details":"Connect the UIM1_RESET_N pin directly to the RESET pin of the UIM card holder.",
            "description":"The UIM1_RESET_N pin connects to the RESET pin of the UIM card holder. The UIM holder facilitates the physical connection of the SIM card to the module."
          },
          {
            "component_name":"ESD Suppressor Diode Array (e.g., STMicroelectronics DALC208SC6)",
            "connection_details":"Place the ESD suppressor diode array between the UIM1_RESET_N pin and ground, or as per the suppressor's datasheet recommendations.",
            "description":"It is recommended to have ESD protection on the UIM interface signals, including UIM1_RESET_N. An ESD suppressor diode array is suggested to protect against electrostatic discharge."
          },
          {
            "component_name":"Pull-up Resistor (RCLKS)",
            "connection_details":"Consult the specific schematic in Figure 5-8 for the recommended connection of resistors and capacitors around the UIM interface. It shows placeholder resistors RCLK and RDATA which might have pull-up functionality.",
            "description":"While not explicitly stated for UIM1_RESET_N, a pull-up resistor is sometimes used in UIM interfaces to ensure a defined high state. However, the document emphasizes not adding external pull-ups where not specified."
          }
        ],
        "connectivity":"The UIM1_RESET_N pin should be connected to the RESET pin of the UIM card holder. The Semtech RC76xx module drives this signal, and it is crucial to connect it directly to the UIM interface for proper operation.",
        "detailed_description":"The UIM1_RESET_N pin is an output signal from the Semtech RC76xx module that controls the reset state of the UIM (Universal Identity Module) interface. It is used to initialize or reset the SIM card inserted into the UIM1 slot. The pin is typically driven low by the module to reset the SIM card and then driven high to allow the SIM card to operate normally.",
        "functionality":"The primary function of UIM1_RESET_N is to reset the UIM interface. The documentation does not indicate that this pin serves different functions based on connectivity.",
        "precautions":[
          "The UIM1_RESET_N signal should be connected directly to the UIM card holder's RESET pin. Avoid intermediate components unless they are for ESD protection.",
          "Ensure proper ESD protection is implemented on this pin to prevent damage to the module or the SIM card, especially if the UIM holder is accessible to the user.",
          "When the module is booting or resetting, the UIM1_RESET_N pin has a default state, which is typically low to ensure the SIM card is reset. Ensure your design accounts for this behavior.",
          "The UIM interface signals, including UIM1_RESET_N, must be routed away from noisy signals and kept as short as possible to maintain signal integrity."
        ]
      },
      "name":"UIM1_RESET_N",
      "pin_id":"29",
      "type":"DIGITAL",
      "voltage":"1.8V / 2.85V"
    },
    "UIM1_SIMA_DET":{
      "description":"Detect UIM1\ninsertion/removal.\n(Pin must be open\nto detect the UIM,\nor grounded if no\nUIM is present.)",
      "direction":"INPUT",
      "group":"UIM1",
      "if_unused":"Mandatory connection",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM Holder",
            "description":"A physical socket designed to accept a UIM card. The SIM presence detect mechanism within the holder would be connected to UIM1_SIMA_DET."
          },
          {
            "component_name":"External Pull-up Resistor",
            "description":"A resistor (typically 470 kΩ, as mentioned in the document) connected between VGPIO and UIM1_SIMA_DET. This is recommended for proper SIM detection functionality."
          }
        ],
        "connectivity":"For SIM Detect functionality, it needs to be connected to the UIM holder's SIM presence detect mechanism. For General Purpose Input/Output functionality, it can be connected to other digital signals or left open if unused. An external pull-up resistor is recommended when used as a SIM detect input.",
        "detailed_description":"The UIM1_SIMA_DET pin is used to detect the physical presence of a UIM (Universal Identity Module) card in the UIM holder. It is an input to the module from the host.",
        "functionality":"This pin serves two functions: 1. SIM Detect: To detect the physical presence of a UIM card. 2. General Purpose Input/Output: Can be configured as a general-purpose input/output pin.",
        "precautions":"1. Pin is 'wakeable': Can be used to trigger the module to wake up from sleep mode. 2. When used for SIM Detect, an external pull-up resistor is required. 3. If not used for SIM Detect or as a wakeable pin, it can be left open. 4. If used as a GPIO, the external SIM detect feature must be disabled first using AT!CUSTOM=\"EXTUIMSWITCHEN\",0, then configure GPIO4 using AT+WIOCFG=4,4. 5. There should not be any voltage applied to the GPIOs when the module is off or resetting."
      },
      "internal_pull":{
        "direction":"UP"
      },
      "name":"UIM1_SIMA_DET",
      "pin_id":"64",
      "type":"DIGITAL"
    },
    "UIM1_SIMB_DET":{
      "description":"Detect UIM1_SIMB\ninsertion / removal /\nGeneral purpose I/\nO",
      "direction":"INPUT",
      "group":"UIM1/\nGPIO",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External Pull-up Resistor",
            "description":"A resistor connected between this pin and VGPIO (1.8V) to ensure a defined high logic level when no SIM is present or when used as a GPIO input.",
            "typical_values":"55 kΩ to 390 kΩ (general GPIO pull-up range) or 10 kΩ to 100 kΩ (specific to UIM interface detection, though not explicitly stated for this pin)."
          },
          {
            "component_name":"Secondary SIM Card Holder (UIM B)",
            "description":"The pin connects to the SIM detection pin of the secondary SIM card holder. The holder should be designed to provide a logic high signal when a SIM is inserted and a logic low (or floating) when it is removed, typically with the pull-up resistor."
          },
          {
            "component_name":"Other Digital Components (for GPIO functionality)",
            "description":"If used as a GPIO, this pin can be connected to other digital components like buttons, sensors, or microcontrollers for input or output signals."
          }
        ],
        "connectivity":"For SIM detection, this pin requires an external pull-up resistor. The specific value is not detailed, but external pull-up resistors are generally in the kΩ range. The pin should be connected to the detection pin of the secondary SIM card holder.\nFor GPIO functionality, it needs to be configured via AT commands (AT+WIOCFG=65,4) and can then be connected to other digital components as an input or output.",
        "detailed_description":"The UIM1_SIMB_DET pin is an input signal used to detect the physical presence of a UIM card in a secondary SIM holder (UIM B). It is part of the UIM interface functionality for managing dual SIM configurations. This pin is also configurable as a General Purpose Input/Output (GPIO).",
        "functionality":"This pin serves two primary functions:\n1. SIM Detect: It detects the presence or absence of a SIM card in the secondary SIM holder (UIM B). When a SIM card is inserted, the signal goes high; when removed, it goes low.\n2. General Purpose Input/Output (GPIO): When not used for SIM detection, it can be configured and used as a general-purpose input/output pin for other application-specific tasks.",
        "precautions":"When used for SIM detection, ensure the external pull-up resistor is correctly sized. If the pin is configured as a GPIO, ensure the external circuit does not violate the voltage or current limits for GPIO pins. Also, note that this pin is 'wakeable', meaning it can wake the module from Sleep mode if configured as a wakeup source. The 'If Unused' state indicates 'Leave open', but for reliable SIM detection, a pull-up is required. If the pull-up is not used and the pin is left floating, it may not reliably detect the SIM state without a defined pull-up."
      },
      "internal_pull":{
        "direction":"DOWN"
      },
      "name":"UIM1_SIMB_DET",
      "pin_id":"65",
      "type":"DIGITAL"
    },
    "UIM1_VCC":{
      "description":"Supply output",
      "direction":"OUTPUT",
      "group":"UIM1",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_description":"A connector designed to accept a physical SIM card. The VCC pin of the holder connects to UIM1_VCC.",
            "component_name":"UIM Holder/Socket"
          },
          {
            "component_description":"Small capacitors (e.g., 100nF, 1nF, 4.7uF) connected from UIM1_VCC to ground to filter noise and ensure stable voltage supply.",
            "component_name":"Decoupling Capacitors"
          },
          {
            "component_description":"A device (e.g., a diode array like DALC208SC6) connected between UIM1_VCC and ground to protect the module and SIM card from electrostatic discharge.",
            "component_name":"ESD Protection Device"
          }
        ],
        "connectivity":"This pin should be connected to the VCC pin of the UIM1 card holder or socket. It is also recommended to connect a decoupling capacitor (typically 100nF and 1nF in parallel) and a 4.7uF capacitor from this pin to ground, placed as close as possible to the UIM card connector. ESD protection is also recommended for this pin.",
        "detailed_description":"UIM1_VCC is an output pin that provides a regulated voltage supply to the UIM1 interface, which is used to power the SIM card. It supports both 1.8V and 2.85V UIM cards, allowing for compatibility with different SIM card standards.",
        "functionality":"The primary function is to supply power to the UIM1 interface. The voltage level (1.8V or 2.85V) is selectable based on the SIM card type or configuration. In cases where the UIM1 interface is not used, this pin should be left open.",
        "precautions":[
          "Ensure the correct voltage level (1.8V or 2.85V) is supported or configured for the connected SIM card.",
          "Place decoupling capacitors and ESD protection components as close as possible to the UIM card connector to maximize their effectiveness.",
          "If the UIM1 interface is not used, this pin must be left open to prevent potential issues.",
          "Refer to the UIM interface schematic in Figure 5-8 for a detailed implementation example."
        ]
      },
      "name":"UIM1_VCC",
      "pin_id":"26",
      "type":"POWER",
      "voltage":"1.8V / 2.85V"
    },
    "UIM2_CLK":{
      "description":"UIM1 Clock",
      "direction":"OUTPUT",
      "group":"UIM2",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM2 Interface / eSIM",
            "connection_details":"Connect directly to the UIM2_CLK pin of the UIM2 interface or eSIM component. Ensure that the voltage level (1.8V or 2.85V) is compatible with the chosen UIM/eSIM."
          }
        ],
        "connectivity":"The UIM2_CLK pin should be connected to the corresponding UIM2_CLK pin on the UIM2 interface or the eSIM component. For standard operation, the pin should be connected directly. If the UIM2 interface is unused, the pin should be left open.",
        "detailed_description":"The UIM2_CLK pin is an output signal from the module that provides the clock signal for the second Universal Subscriber Identity Module (UIM) interface. This clock signal is essential for the UIM card's operation, synchronizing data transfer between the module and the UIM.",
        "functionality":"This pin is primarily used as UIM2_CLK for the second UIM interface. However, in specific limited availability variants (RC7612 and RC7612-1), this pin is also designated as a 'Core' type, indicating its essential role for basic module functionality. It is also noted that the pin can be 'wakeable,' meaning it can be used to trigger the module to wake up from a sleep state.",
        "precautions":[
          "For RC7611, RC7620, RC7630, and RC7630J* variants, UIM2 signals (including UIM2_CLK) are not available externally, as this interface is used for an eSIM. Ensure the correct variant is being used if external UIM2 connectivity is required.",
          "The UIM2_CLK pin operates at either 1.8V or 2.85V. Ensure the connected UIM/eSIM component supports the chosen voltage level.",
          "If the UIM2 interface is not used, the pin should be left open to avoid any potential issues.",
          "While the pin is marked as 'wakeable', its use for waking the module from sleep state requires specific firmware configuration. Consult the RC76xx AT Command Reference for details on enabling this functionality."
        ]
      },
      "name":"UIM2_CLK",
      "pin_id":"58",
      "type":"DIGITAL"
    },
    "UIM2_DATA":{
      "description":"UIM1",
      "direction":"BIDIRECTIONAL",
      "group":"UIM2",
      "if_unused":"Leave",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM Connector / eSIM",
            "connection_details":"Connects to the DATA pin of the UIM connector or the eSIM module.",
            "notes":"Only applicable for RC7612 and RC7612-1 variants."
          }
        ],
        "connectivity":"In the RC7612 and RC7612-1 variants, UIM2_DATA connects to the DATA pin of the second UIM connector or eSIM. For other variants where it's associated with an eSIM, it's internally connected and not exposed externally.",
        "detailed_description":"UIM2_DATA is the data interface pin for the second Universal Integrated Circuit (UIM) interface. This pin handles the bidirectional communication of data between the module and the UIM card or eSIM.",
        "functionality":"The primary function of UIM2_DATA is to transmit and receive data for the second UIM interface. For RC7611, RC7620, RC7630, and RC7630J* variants, this pin is associated with an eSIM and is not externally available. For RC7612 and RC7612-1 (Limited Availability) variants, this pin is available for an external UIM card.",
        "precautions":[
          "For RC7611, RC7620, RC7630, and RC7630J* variants, this pin is associated with an eSIM and is not available externally. Do not attempt to connect external components to it.",
          "UIM1 and UIM2 cannot be activated simultaneously. Ensure proper SIM selection is configured via AT commands.",
          "The UIM interface signals, including UIM2_DATA, must be ESD protected if exposed externally."
        ]
      },
      "name":"UIM2_DATA",
      "pin_id":"56",
      "type":"DIGITAL"
    },
    "UIM2_RESET_N":{
      "description":"UIM1",
      "direction":"OUTPUT",
      "group":"UIM2",
      "if_unused":"Leave",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM2 Interface (External UIM or eSIM)",
            "details":"Connects to the RESET pin of the UIM2 interface. The module provides the reset signal to this pin. For RC7612/RC7612-1, this would be an external UIM connector. For other variants, it controls an eSIM on the module."
          }
        ],
        "connectivity":"The UIM2_RESET_N pin should be connected to the RESET pin of the UIM2 interface (either an external UIM connector or an eSIM). The connection should be a direct wire from the module's UIM2_RESET_N pin to the UIM2 interface's RESET pin.",
        "detailed_description":"UIM2_RESET_N is an output signal from the module that provides a reset signal to the UIM2 interface. This signal is used to reset the UIM2 interface, which can be an external UIM or an eSIM, during the power-up sequence or during normal operation if a reset is required.",
        "functionality":"The UIM2_RESET_N signal's primary function is to reset the UIM2 interface. Its functionality depends on whether it is connected to an external UIM or an eSIM. For RC7612 and RC7612-1, it interfaces with an external UIM2. For other variants (RC7611, RC7620, RC7630, and RC7630J*), it controls an eSIM. The specific behavior (e.g., timing, voltage levels) might be dictated by the UIM/eSIM standard and the module's firmware.",
        "precautions":[
          "Ensure the voltage level of UIM2_RESET_N is compatible with the UIM2 interface (1.8V or 2.85V).",
          "Follow the timing requirements for the UIM reset signal as specified by the UIM/eSIM standard and the module's documentation.",
          "Do not connect any external pull-up resistors to this pin, as the module manages the signal's state internally.",
          "The pin's functionality and availability might vary between module variants (e.g., RC7612/RC7612-1 vs. other variants). Refer to the specific variant's documentation.",
          "If the UIM2 interface is not used, this pin can be left open as per the datasheet's 'If Unused' column."
        ]
      },
      "name":"UIM2_RESET_N",
      "pin_id":"57",
      "type":"DIGITAL"
    },
    "UIM2_VCC":{
      "description":"UIM1 Power",
      "direction":"OUTPUT",
      "group":"UIM2",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"UIM2 Interface (eSIM or External UIM Connector)",
            "connection_details":"Connects to the VCC pin of the UIM2 interface."
          },
          {
            "component_name":"Power Supply Regulator (internal or external)",
            "connection_details":"Provides the 1.8V or 2.85V supply voltage to the UIM2_VCC pin, selectable based on the UIM card/eSIM requirement."
          }
        ],
        "connectivity":"This pin should be connected to the VCC (power supply) pin of the UIM2 interface, whether it's an eSIM or an external UIM card connector. The voltage level is selectable (1.8V or 2.85V) based on the UIM card or eSIM. If the UIM2 interface is not used, this pin should be left open.",
        "detailed_description":"UIM2_VCC is an output pin that supplies power to the second UIM interface (UIM2). The voltage provided is either 1.8V or 2.85V, depending on the UIM card's requirements. This pin is part of the module's UIM interface functionality.",
        "functionality":"This pin serves as a power supply output for the UIM2 interface. For specific variants (RC7611, RC7620, RC7630, and RC7630J*), this interface is associated with an eSIM. For RC7612 and RC7612-1 variants (Limited Availability), it is an external UIM2 interface. The pin is powered down when UIM2 is deselected.",
        "precautions":[
          "Ensure that the correct voltage (1.8V or 2.85V) is provided to the UIM2_VCC pin based on the UIM card or eSIM being used. Incorrect voltage can lead to damage.",
          "If the UIM2 interface is not used, leave the UIM2_VCC pin unconnected to prevent potential issues.",
          "The UIM2 interface cannot be activated simultaneously with the UIM1 interface. Ensure proper SIM selection logic is implemented.",
          "Refer to the RC76xx AT Command Reference for details on managing SIM selection and power states of the UIM2 interface."
        ]
      },
      "name":"UIM2_VCC",
      "pin_id":"55",
      "type":"POWER",
      "voltage":"1.8V / 2.85V"
    },
    "USB_D+":{
      "description":"Differential data interface positive",
      "direction":"BIDIRECTIONAL",
      "group":"USB",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host USB connector",
            "description":"The external USB connector on the host device. The USB_D+ pin of the module connects to the corresponding USB_D+ pin on this connector."
          },
          {
            "component_name":"Module USB_D+ pin",
            "description":"The internal pin on the RC76xx module that is part of the USB interface."
          }
        ],
        "connectivity":"Connect to the USB_D+ pin of the host USB connector. It should also be connected to the USB_D+ pin of the module.",
        "detailed_description":"USB_D+ is the positive data line for the high-speed USB 2.0 interface. It is part of the differential data pair (USB_D+ and USB_D-) used for communication.",
        "functionality":"The pin serves as a bidirectional data line for USB 2.0 communication. It operates as part of a differential signaling pair to ensure robust data transfer.",
        "precautions":[
          "The USB interface has routing constraints. Refer to Section 5.7.4 'USB Interface' for details.",
          "It is recommended to make the USB interface accessible through test points for debugging.",
          "ESD protection is required on the USB_D+ line, as well as USB_D- and USB_VBUS.",
          "Differential data pair matching should be within 3.8 mm (150 mils).",
          "Avoid having multiple vias on the USB traces as they can cause signal reflection.",
          "Avoid stubs on the USB traces.",
          "Test points on USB traces must comply with radio frequency signal routing rules to avoid degradation of USB signal quality.",
          "The USB_VBUS trace width should be sized appropriately for the expected current and length."
        ]
      },
      "name":"USB_D+",
      "pin_id":"13",
      "type":"DIGITAL"
    },
    "USB_D-":{
      "description":"Differential data interface negative",
      "direction":"BIDIRECTIONAL",
      "group":"USB",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host USB Connector/Controller",
            "connection_details":"Direct connection to the USB_D- pin of the host."
          },
          {
            "component_name":"ESD Protection Device",
            "connection_details":"Recommended to have ESD protection on this pin, connected between the pin and ground, typically a diode array."
          }
        ],
        "connectivity":"In a schematic, USB_D- should be connected to the corresponding USB_D- pin of the host USB connector or controller. It is part of a differential pair and should be routed with its complementary signal (USB_D+) to maintain signal integrity.",
        "detailed_description":"USB_D- is the negative differential data line for the High-Speed USB 2.0 interface. It is part of the differential pair (USB_D+ and USB_D-) used for high-speed data communication.",
        "functionality":"The pin serves as a bidirectional data line for USB communication. Its function is solely related to the USB 2.0 High-Speed interface.",
        "precautions":[
          "Route as a differential pair with USB_D+ for optimal signal integrity, maintaining controlled impedance (90 Ω differential) and matching trace lengths.",
          "Keep the traces away from sensitive circuits and signals (RF, system clock) to prevent interference.",
          "Minimize the number of vias to reduce signal reflection and impedance discontinuities.",
          "Avoid stubs on these traces.",
          "Ensure proper ESD protection is implemented on this pin."
        ]
      },
      "name":"USB_D-",
      "pin_id":"12",
      "type":"DIGITAL"
    },
    "VBAT_BB":{
      "description":"Baseband power\nsupply (seePower\nSupply Ratings)",
      "direction":"INPUT",
      "group":"Power",
      "if_unused":"Optional\nconnection",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Regulated DC Power Supply",
            "details":"Provides a stable DC voltage within the specified operating range (3.2V to 4.3V) for the VBAT_BB pin. This can be a battery, a voltage regulator, or a power management IC."
          },
          {
            "component_name":"Capacitors",
            "details":"Decoupling capacitors (e.g., 47 µF) should be placed close to the VBAT_BB pin to filter noise and handle current peaks, as described in the 'Power Supply' and 'Routing Constraints and Recommendations' sections."
          }
        ],
        "connectivity":"VBAT_BB should be connected to a regulated DC power supply. It can be connected either as a single supply to both VBAT_BB and VBAT_RF, or as separate supplies for each. The voltage range must be maintained between 3.2V and 4.3V (nominal 3.7V).",
        "detailed_description":"VBAT_BB is the power supply input for the Baseband section of the Semtech RC76xx module. It requires a regulated DC voltage within a specified range to operate correctly.",
        "functionality":"The primary function of VBAT_BB is to supply power to the baseband processing unit of the module. It can be connected as a single regulated DC power supply or as one of two regulated DC power supplies, with VBAT_RF being the other.",
        "precautions":[
          "The voltage applied to VBAT_BB must strictly remain within the specified operating range (3.2V to 4.3V). Exceeding the maximum specified operating voltage can damage the module.",
          "Ensure the power supply has sufficient current capability to handle the peak current demands of the baseband processor, especially during high-load operations.",
          "Minimize voltage ripple and transients on the VBAT_BB supply line. Refer to Table 3-3 for specific ripple and transient voltage limits.",
          "Proper decoupling is essential to maintain stable operation and prevent noise coupling. Place decoupling capacitors as close as possible to the module's VBAT_BB pin.",
          "The impedance of the power supply and power delivery network should be kept as low as possible to reduce voltage drop during current peaks."
        ]
      },
      "name":"VBAT_BB",
      "pin_id":"158",
      "type":"POWER"
    },
    "VBAT_RF":{
      "description":"RF power supply\n(seePower Supply\nRatings)",
      "direction":"INPUT",
      "group":"Power",
      "if_unused":"Optional\nconnection",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Regulated DC power supply",
            "details":"A regulated DC power supply with a nominal voltage of 3.7V. The supply must be capable of delivering the required current for the RF components, especially during transmission. The power supply voltage must be within the specified operating range (3.2V to 4.3V) and should have low ripple and transients."
          },
          {
            "component_name":"Capacitors",
            "details":"Decoupling capacitors should be placed as close as possible to the VBAT_RF pins to filter noise and ensure stable power delivery. Typically, this would include larger bulk capacitors (e.g., 10-47 µF) and smaller ceramic capacitors (e.g., 10-33 pF)."
          }
        ],
        "connectivity":"VBAT_RF should be connected to a regulated DC power supply. It can be connected to a single regulated DC power supply (3.7V nominal) shared with VBAT_BB, or to a separate regulated DC power supply (3.7V nominal) dedicated to the RF components.",
        "detailed_description":"VBAT_RF is the RF power supply input pin for the Semtech RC76xx module. It is responsible for providing the necessary power to the radio frequency components of the module.",
        "functionality":"The pin serves as a power supply input for the RF section. It can be used as a single supply for both VBAT_BB and VBAT_RF, or as a separate supply for VBAT_RF.",
        "precautions":[
          "The voltage applied to VBAT_RF must be within the specified operating range (3.2V to 4.3V). Exceeding this range can damage the module's RF components.",
          "The power supply must have low ripple and transients, as specified in the datasheet (e.g., power supply ripple < 100 mVpp).",
          "Ensure the power supply and its traces can deliver the peak currents required by the RF components during transmission.",
          "Adequate decoupling capacitors must be placed close to the VBAT_RF pins to ensure stable operation and prevent noise coupling.",
          "If VBAT_BB and VBAT_RF are supplied separately, ensure their voltage levels are within their respective operating ranges."
        ]
      },
      "name":"VBAT_RF",
      "pin_id":"157",
      "type":"POWER"
    },
    "VGPIO":{
      "description":"GPIO voltage\noutput",
      "direction":"OUTPUT",
      "group":"Voltage\nreference",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"External digital circuitry",
            "description":"Components requiring a 1.8V logic supply, such as pull-up resistors for I/O pins, LEDs, or other digital components."
          },
          {
            "component_name":"ADC interfaces",
            "description":"The VGPIO pin can be used as a voltage reference for the module's ADC inputs."
          },
          {
            "component_name":"External regulator",
            "description":"If the current draw from VGPIO exceeds its capability, an external voltage regulator can be used to provide a higher current supply."
          }
        ],
        "connectivity":"The VGPIO pin should be connected to external circuitry that requires a 1.8V logic level supply. If a higher current is needed than what VGPIO can supply, an external regulator should be used to step up the voltage.",
        "detailed_description":"The VGPIO pin serves as a 1.8V logic voltage output from the Semtech RC76xx module. This voltage is provided when the module is powered ON and is used to supply external circuitry, pull up I/Os, or act as a voltage reference for ADC interfaces.",
        "functionality":"The VGPIO pin provides a stable 1.8V output. Its functionality is primarily to supply power to external digital components. It is also used as a reference voltage for ADC inputs. The VGPIO is active (1.8V) when the module is in active or sleep mode and is off (high impedance) when the module is in PSM or off mode.",
        "precautions":[
          "The VGPIO output current capability is limited to 50 mA. Do not exceed this limit; use an external regulator if higher current is required.",
          "VGPIO is off (high impedance) when the module is in PSM or off mode. Ensure that external circuitry connected to VGPIO handles this state appropriately.",
          "Ensure that signals referenced to VGPIO are properly managed when the module transitions between power states to avoid unexpected behavior or damage."
        ]
      },
      "name":"VGPIO",
      "pin_id":"45",
      "type":"POWER"
    },
    "WAKE_ON_WWAN":{
      "description":"Driven high to wake\nthe host when\nspecific events\noccur.",
      "direction":"OUTPUT",
      "group":"Indication",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"Host Device Input Pin",
            "description":"An input pin on the host microcontroller or system that can detect a logic high signal. This pin will be used to trigger an interrupt or polling mechanism on the host to handle the event indicated by WAKE_ON_WWAN."
          },
          {
            "component_name":"Pull-up Resistor (on Host Side)",
            "description":"A resistor connected between the host input pin and the host's VGPIO (or equivalent logic supply) to ensure a defined logic high state when the WAKE_ON_WWAN signal is active. The value of this resistor should be chosen based on the host's input impedance and desired signal rise time, typically in the range of 10 kΩ to 100 kΩ."
          }
        ],
        "connectivity":"The WAKE_ON_WWAN pin should be connected to a suitable input on the host device that can detect a logic high signal. A recommended implementation involves a pull-up resistor on the host side, with the module's WAKE_ON_WWAN pin connected to this pull-up. The specific value of the pull-up resistor would depend on the host's input characteristics and general schematic design practices.",
        "detailed_description":"The WAKE_ON_WWAN pin is a digital output signal from the Semtech RC76xx module that is designed to wake up a host device when specific events occur within the module. These events include, but are not limited to, an incoming SMS message or incoming data packets.",
        "functionality":"The pin's functionality is to signal the host device that an event requiring attention has occurred. This can be configured by the host using the AT!CUSTOM command with the WAKEHOSTEN option. When configured, the module drives this pin high to initiate the wake-up sequence for the host. The specific events that trigger this signal depend on firmware settings and host driver configurations (e.g., QMI event registration for incoming data packets).",
        "precautions":[
          "Host support for the WAKE_ON_WWAN signal is optional. If the host does not require this functionality, the pin can be left unconnected.",
          "The functionality of the WAKE_ON_WWAN pin can be configured using AT commands (AT!CUSTOM with WAKEHOSTEN option). Ensure this is correctly configured based on the intended application.",
          "For Linux Host systems, enabling WDS event reporting in the SDK application is crucial for the WAKE_ON_WWAN pin to be triggered by incoming data packets.",
          "Ensure proper impedance matching and signal integrity for the connection between the module and the host device."
        ]
      },
      "name":"WAKE_ON_WWAN",
      "pin_id":"110",
      "type":"DIGITAL"
    },
    "WWAN_LED_N":{
      "description":"LED driver control",
      "direction":"OUTPUT",
      "group":"Indication",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":[
          {
            "component_name":"LED",
            "details":"A Light Emitting Diode that visually indicates WWAN status."
          },
          {
            "component_name":"Current-limiting resistor",
            "details":"A resistor is required to limit the current flowing through the LED to prevent damage. The value of the resistor will depend on the forward voltage of the LED and the supply voltage (VGPIO)."
          },
          {
            "component_name":"VGPIO",
            "details":"The 1.8V GPIO voltage output from the module, which provides the necessary supply voltage for the LED circuit."
          }
        ],
        "connectivity":"The WWAN_LED_N pin should be connected to the anode of an external LED. The cathode of the LED should be connected to a current-limiting resistor, which is then connected to the module's VGPIO supply. Alternatively, if the LED is designed to be driven directly from the module, the WWAN_LED_N pin can be connected to the cathode of an LED, with the anode connected to the current-limiting resistor and then to VGPIO.",
        "detailed_description":"The WWAN_LED_N pin is an output signal from the Semtech RC76xx module that serves as an LED driver control.",
        "functionality":"This pin is used to control an external LED, typically to indicate WWAN activity or status. It acts as a sink for current, allowing an external LED to be driven when the pin is pulled low by the module.",
        "precautions":"The WWAN_LED_N pin has a maximum current sink capability of 40 mA. Ensure that the current-limiting resistor is correctly chosen to stay within this limit and to prevent damage to the LED or the module. The voltage on this pin will be approximately VGPIO (1.8V) when not active and can source current when pulled low. If connecting an LED directly, ensure the LED's forward voltage is compatible with the VGPIO supply."
      },
      "name":"WWAN_LED_N",
      "pin_id":"106",
      "type":"DIGITAL"
    },
    "W_DISABLE_N":{
      "description":"Wireless disable\n(main RF radio)",
      "direction":"INPUT",
      "group":"Control\nSignal",
      "if_unused":"Leave open",
      "implementation":{
        "connected_components":"The W_DISABLE_N pin is typically connected to a general-purpose output (GPO) or a similar control pin on the host microcontroller or system. The host's GPIO should be configured to drive this pin low when radio disable is required and to enter a high-impedance or floating state otherwise. No external pull-up resistor is needed as one is provided internally by the module.",
        "connectivity":"This pin should be connected to a host device's control signal. The host device controls the state of this pin. It is recommended to leave this signal unconnected if the host device does not need to control the module's radio state. The pin has an internal pull-up resistor to an internal 1.8V rail.",
        "detailed_description":"The W_DISABLE_N pin is an input to the module that is used by the host device to enable or disable the WWAN radio (modem). When this signal is asserted (driven low), the modem cannot transmit or receive information. When the signal is de-asserted (floating or high impedance), the radio operates normally.",
        "functionality":"The primary function is to control the power state of the WWAN radio. It acts as a digital input. When driven low, it disables the radio; when floating or high impedance, it allows the radio to operate normally. It is an input to the module and is intended for host control.",
        "precautions":"The host should drive this pin LOW only for its active state (disabling the radio). It should never be driven to a logic high level by the host. If the host never needs to assert this power state control to the module, leaving the signal unconnected is acceptable. Ensure the host's output is capable of driving the pin low and entering a high-impedance state. Avoid connecting this pin to any other components or signals without careful consideration of the internal pull-up and the intended functionality."
      },
      "internal_pull":{
        "direction":"UP"
      },
      "name":"W_DISABLE_N",
      "pin_id":"151",
      "type":"DIGITAL"
    }
  }
}