{
  "high_level":{
    "base_part_number":"TPS1HTC30-Q1",
    "device_type":"HIGH_SIDE_DRIVER",
    "manufacturer":"Texas Instruments",
    "packages":[
      "HTSSOP-14"
    ],
    "part_numbers":{
      "TPS1HTC30AQPWPRQ1":{
        "options":{
          "operating_temperature_range_c":"-40 to 125",
          "package_type":"HTSSOP",
          "pin_count":"14",
          "spq":"3000"
        }
      }
    }
  },
  "pins":{
    "DIAG_EN":{
      "description":"Enable-disable pin for diagnostics, internal pulldown",
      "direction":"INPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Microcontroller (MCU) GPIO",
            "description":"Used to provide the logic high/low signal to control the pin's state."
          },
          {
            "component":"Series Protection Resistor (R_PROT)",
            "description":"A resistor, recommended to be between 5 kΩ and 10 kΩ, should be placed in series between the MCU GPIO pin and the DIAG_EN pin. This resistor protects the MCU I/O from potential negative voltage transients on the device's ground line, which can occur during events like negative ISO pulses or loss of ground."
          }
        ],
        "connectivity":"The DIAG_EN pin should be connected to a General-Purpose Input/Output (GPIO) pin of a microcontroller. This connection allows the system to dynamically enable or disable diagnostics to save power or perform measurements as needed. If the diagnostic features are not used in the application, the pin can be left floating or connected to ground, typically through a protection resistor.",
        "detailed_description":"The DIAG_EN pin is a logic input that enables or disables the device's diagnostic features. When enabled (driven high), it activates functions like high-accuracy current sensing via the SNS pin and open-load detection. It also allows for off-state diagnostics. When disabled (driven low or floating), diagnostic features are turned off, and the device enters a very low power standby mode if the EN pin is also low, significantly reducing quiescent current. A key function of this pin is to scale the maximum fault voltage (VSNSFH) reported on the SNS pin. The voltage on DIAG_EN sets the clamp voltage on SNS, protecting the connected MCU's ADC input without needing external clamping components.",
        "functionality":"The pin's function is determined by its logic level:\n- Logic High: Enables all diagnostic features, including current sense (SNS pin), open-load detection, and fault reporting. The device consumes about 1 mA in standby for off-state diagnostics. The input voltage level (e.g., 3.3V or 5V) sets the corresponding maximum fault voltage on the SNS pin.\n- Logic Low or Floating: Disables all diagnostic features. The FAULT and SNS pins are set to a high-impedance state. If the EN pin is also low, the device enters a low-power standby mode with less than 0.5 µA of standby current. The pin has an internal pulldown resistor, so floating it is equivalent to a logic low state.",
        "precautions":"A series protection resistor (R_PROT) is required to protect the connected MCU I/O pin from damage during fault conditions like a negative potential on the device ground. The voltage level applied to the DIAG_EN pin directly influences the maximum voltage (VSNSFH) on the SNS analog output pin; the system designer must ensure the MCU's ADC can handle this voltage. If diagnostic features are required for the application, the DIAG_EN pin must be actively driven high by an external source like an MCU, as leaving the pin floating will disable diagnostics due to the internal pulldown resistor. Disabling diagnostics (DIAG_EN low) also puts the FAULT and SNS pins into a high-impedance state, making fault information unavailable to the MCU, although internal protections like current limit and thermal shutdown remain active."
      },
      "input_voltage":{
        "max":5.5,
        "min":-1.0,
        "units":"V"
      },
      "internal_pull":{
        "direction":"DOWN",
        "pull_value":{
          "max":500000.0,
          "min":200000.0,
          "nom":350000.0,
          "units":"Ω"
        },
        "type":"RESISTANCE"
      },
      "name":"DIAG_EN",
      "pin_id":"3",
      "type":"DIGITAL",
      "vih":{
        "min":1.5,
        "units":"V"
      },
      "vil":{
        "max":0.8,
        "units":"V"
      }
    },
    "EN":{
      "description":"Input control for channel activation, internal pulldown",
      "direction":"INPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Microcontroller (MCU)",
            "description":"A digital output pin from an MCU provides the logic high/low signal to control the state of the high-side switch."
          },
          {
            "component":"Series Protection Resistor (R_PROT)",
            "description":"A resistor connected in series between the MCU GPIO and the EN pin. The datasheet recommends a value between 5 kΩ and 10 kΩ. This resistor limits current and protects both the MCU and the EN pin during transient fault conditions, such as negative voltage pulses or loss of ground."
          }
        ],
        "connectivity":"The EN pin should be connected to a digital General Purpose Input/Output (GPIO) pin of a microcontroller. A series resistor must be placed between the microcontroller's GPIO and the EN pin for protection.",
        "detailed_description":"The EN pin is the primary digital input control for activating the high-side switch channel. A logic high signal on this pin enables the main power FET, allowing current to flow from the VS pin to the VOUT pin and the connected load. A logic low signal disables the channel and, after a standby delay time (t_STBY), places the device into a low-power standby mode to minimize current consumption. The pin features an internal pulldown resistor, which ensures the switch defaults to the off state if the pin is left floating.",
        "functionality":"The pin's function is determined by the logic level applied:\n- Logic High (V_EN > 1.5 V): Activates the output high-side switch, putting the device in 'Normal Mode'. It is compatible with 1.8V, 3.3V, and 5V logic levels.\n- Logic Low (V_EN < 0.8 V): Deactivates the output high-side switch. If held low for longer than the t_STBY delay, the device transitions to a low-power 'Standby Mode'.\n- Floating: The internal pulldown resistor (350 kΩ typical) pulls the pin to a logic low level, disabling the channel.",
        "precautions":[
          "A series protection resistor (R_PROT) is required to protect the connected MCU I/O pin and the device's EN pin from damage during fault conditions.",
          "The voltage applied to the EN pin must not exceed the absolute maximum rating of 7 V or fall below -1 V.",
          "To ensure a defined state and prevent unintended switching due to noise, it is recommended to actively drive the pin and not leave it floating in a noisy environment, despite the presence of an internal pulldown resistor."
        ]
      },
      "input_voltage":{
        "max":5.5,
        "min":-1.0,
        "units":"V"
      },
      "internal_pull":{
        "direction":"DOWN",
        "pull_value":{
          "max":500000.0,
          "min":200000.0,
          "nom":350000.0,
          "units":"Ω"
        },
        "type":"RESISTANCE"
      },
      "name":"EN",
      "pin_id":"2",
      "type":"DIGITAL",
      "vih":{
        "min":1.5,
        "units":"V"
      },
      "vil":{
        "max":0.8,
        "units":"V"
      }
    },
    "FAULT":{
      "description":"Open drain global fault output. Referred to FLT, or fault pin",
      "direction":"OUTPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Pull-up Resistor",
            "details":"Connects from the FAULT pin to the microcontroller's supply voltage. The datasheet does not specify a value, but a typical value would be in the range of 4.7 kΩ to 10 kΩ, depending on the required signal rise time and power consumption constraints."
          },
          {
            "component":"Series Protection Resistor (RPROT)",
            "details":"Connected in series between the FAULT pin and the microcontroller's input pin. The datasheet recommends a 5 kΩ resistor for this purpose to protect the MCU I/O from events like negative potential on the device's GND pin."
          },
          {
            "component":"Microcontroller (MCU)",
            "details":"The FAULT pin connects to a General Purpose Input (GPIO) pin of the MCU, which is configured to read the digital state of the fault line."
          }
        ],
        "connectivity":"The FAULT pin should be connected to an input pin of a microcontroller. As it is an open-drain output, an external pull-up resistor is required. This resistor should be connected between the FAULT pin trace and the supply voltage rail of the microcontroller (e.g., 3.3V or 5V). Additionally, for protection of the MCU I/O, a series resistor (RPROT) is recommended between the FAULT pin and the MCU input.",
        "detailed_description":"The FAULT pin is an open-drain, active-low, global fault output. It serves as a digital status report to an external microcontroller (MCU). Under normal operating conditions, the pin is in a high-impedance (Hi-Z) state. When a fault condition is detected by the TPS1HTC30-Q1—such as overcurrent, overload, short to ground, overvoltage, or thermal shutdown—the internal open-drain transistor turns on, pulling the pin low to the device's ground potential. This signals the MCU that a fault has occurred.",
        "functionality":"The pin has a singular function: to report faults. Its functionality is binary. In a high-impedance state, it indicates normal operation. When pulled low, it indicates a fault condition. If the pin is left unused (floating), the system loses the ability to receive digital fault notifications from the device.",
        "precautions":"The pin is an open-drain output and cannot source current; it requires an external pull-up resistor to achieve a logic high state. If the fault detection feature is not used, the pin should be left floating. For system robustness, a 5 kΩ series resistor (RPROT) is recommended to protect the connected MCU I/O pin, particularly against events like loss of GND or negative ISO pulses."
      },
      "name":"FAULT",
      "output_type":"OPEN_DRAIN",
      "pin_id":"4",
      "type":"DIGITAL",
      "vol":{
        "max":0.5,
        "units":"V"
      }
    },
    "GND":{
      "description":"Ground of device. Connect to resistor- diode ground network to have reverse battery protection",
      "direction":"INPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"RGND (Resistor)",
            "details":"For reverse battery protection, a 1-kΩ resistor is recommended to be placed in a parallel network with a diode between the GND pin and the system ground. It limits current during reverse battery events and helps manage negative voltage spikes when switching off inductive loads."
          },
          {
            "component":"DGND (Diode)",
            "details":"For reverse battery protection, a diode with a forward current rating of at least 100 mA (e.g., MSX1PJ) is recommended in parallel with the resistor. It blocks reverse voltage and provides a low-impedance path to system ground during normal operation, minimizing ground shift."
          },
          {
            "component":"Thermal Pad",
            "details":"The package's thermal pad is internally connected to the GND pin and must be soldered to a copper ground plane on the PCB. It is essential for dissipating heat from the device."
          }
        ],
        "connectivity":"The GND pin can be connected directly to the system/board ground plane. For reverse battery protection, the datasheet recommends connecting the GND pin to the system ground through a parallel resistor-diode network. The package's thermal pad, being internally connected to GND, should be soldered to a large copper area on the PCB and connected to the system ground plane (through the network if used) with multiple thermal vias for optimal thermal performance.",
        "detailed_description":"The GND pin is the primary ground reference for the TPS1HTC30-Q1. It serves as the return path for the device's quiescent current and is the reference for all internal logic and protection circuits. The thermal pad of the package is internally shorted to this pin, making the ground connection critical for heat dissipation from the device to the PCB.",
        "functionality":"The pin's primary function is as the device ground. However, its external connection scheme determines the implementation of reverse polarity protection. It can be connected directly to the system ground or through a 'GND network' consisting of a resistor and/or a diode. This network protects the IC during reverse battery events by limiting the current flowing into the GND pin.",
        "precautions":"When a GND network is used for reverse polarity protection, a voltage shift occurs between the device's GND pin and the system's board ground. Consequently, any components that reference the device's ground, such as the current limit setting resistor (R_ILIM) on the ILIM pin, must be connected to the device's GND pin, not the system's board ground. Using only a diode for the GND network is not recommended when driving inductive loads. The continuous reverse current into the GND pin must be limited to less than the absolute maximum rating of -50 mA."
      },
      "input_voltage":{
        "nom":0.0,
        "units":"V"
      },
      "name":"GND",
      "pin_id":"1",
      "type":"POWER"
    },
    "ILIM":{
      "description":"Adjustable current limit. Short to ground or leave floating if external current limit is not used",
      "direction":"OUTPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Resistor (R_ILIM)",
            "details":"A single resistor connected between the ILIM pin and device GND to set the current limit. The recommended range for the external resistor is between 10 kΩ and 50 kΩ. For example, using a 20 kΩ resistor sets the current limit to approximately 5 A (100 A*kΩ / 20 kΩ)."
          },
          {
            "component":"Switch and Resistors (optional)",
            "details":"For dynamically changing the current limit, a common setup is two resistors in parallel connected to the ILIM pin, with a switch (e.g., a small MOSFET) in series with one of the resistors. Toggling the switch changes the equivalent resistance to ground, thereby changing the current limit threshold."
          },
          {
            "component":"Digital Potentiometer (optional)",
            "details":"A digital potentiometer can be used to provide fine, on-the-fly adjustment of the current limit by varying the resistance on the ILIM pin."
          }
        ],
        "connectivity":"The ILIM pin should be connected in one of the following ways:\n- **For programmable limit:** Connect a resistor (R_ILIM) from the ILIM pin to the device's GND pin (pin 1).\n- **For 16 A limit:** Connect the ILIM pin directly to the device's GND pin (pin 1).\n- **For 8 A limit:** Leave the pin floating (unconnected).\n- **For dynamic adjustment:** A digital potentiometer or a network of resistors and a switch can be connected to the pin to change the resistance to ground during operation.",
        "detailed_description":"The ILIM pin is an output used to set the adjustable current limit for the high-side switch. This feature allows for a high-accuracy, programmable current limit that improves system reliability by clamping inrush current during startup with capacitive loads and protecting the device and power supply during overload or short-circuit conditions. The device always applies the lower value between the externally programmed limit and the internal limit.",
        "functionality":"The pin serves different functions based on its electrical connection:\n1. **External Programmable Limit:** When a resistor (R_ILIM) is connected from this pin to the device's ground, it sets a specific current limit threshold. The current limit (I_LIM_REG) is determined by the formula: I_LIM_REG = K_CL / R_ILIM, where K_CL is the Current Limit Ratio (typically 100 A*kΩ). This allows the limit to be set between 2 A and 16 A.\n2. **Fixed Internal Limit (High):** When the ILIM pin is shorted to the device's ground, a fixed internal current limit of 16 A is selected.\n3. **Fixed Internal Limit (Default/Fail-Safe):** When the ILIM pin is left floating (open) or the external resistor is out of the valid range, the current limit reverts to a default internal value of 8 A. This is a fail-safe feature to prevent excessive current if the programming resistor connection is lost.",
        "precautions":[
          "When a ground network is used (e.g., a resistor and/or diode between the device GND pin and the board ground), the ILIM programming resistor must be connected to the device's GND pin, not the board's ground plane, to ensure accuracy.",
          "Total capacitance on the ILIM pin should be kept below approximately 100 pF to maintain the stability of the current regulation loop.",
          "If the ILIM pin is intended to be unused, it should be left floating to set the default 8 A current limit. Shorting it to ground selects the 16 A limit."
        ]
      },
      "name":"ILIM",
      "pin_id":"7",
      "type":"ANALOG"
    },
    "LATCH":{
      "description":"Thermal shutdown behavior, latch off or auto retry, internal pull down",
      "direction":"INPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Protection Resistor (RPROT)",
            "details":"A series protection resistor is required when connecting the LATCH pin to a microcontroller to protect the MCU I/O. It is also recommended when connecting the pin to ground. Datasheet examples suggest a value between 5 kΩ and 10 kΩ."
          }
        ],
        "connectivity":"For auto-retry behavior, the pin can be left floating (unconnected) or tied to the device's ground, preferably through a protection resistor (RPROT). For latch-off behavior, the pin should be connected to a digital output pin of a microcontroller through a series protection resistor (RPROT).",
        "detailed_description":"The LATCH pin is a logic input that configures the device's thermal shutdown behavior. It determines whether the device will automatically attempt to restart (auto-retry) or will remain in an off-state (latch-off) after a thermal fault has occurred and has been cleared.",
        "functionality":"Yes, the pin's function is determined by its logic level. If the LATCH pin is held low or left floating (utilizing its internal pulldown resistor), the device enters an auto-retry mode after a thermal shutdown event. In this mode, it will automatically attempt to turn the output back on after a specified retry time (t_RETRY) once the temperature has dropped below the hysteresis threshold. If the LATCH pin is held high, the device enters a latch-off mode. In this mode, after a thermal shutdown, the output will remain off until the LATCH pin or the EN pin is toggled (brought low and then high again).",
        "precautions":"A series protection resistor (RPROT) is required when connecting the LATCH pin to an MCU. This is to protect the MCU I/O from potential damage during events like negative ISO pulses or loss of battery with an inductive load, which can cause a negative potential on the device's GND pin. The voltage applied to the LATCH pin must be kept within the recommended operating range of -1 V to 5.5 V and must not exceed the absolute maximum rating of 7 V."
      },
      "input_voltage":{
        "max":5.5,
        "min":-1.0,
        "units":"V"
      },
      "internal_pull":{
        "direction":"DOWN",
        "pull_value":{
          "max":1400000.0,
          "min":700000.0,
          "nom":1000000.0,
          "units":"Ω"
        },
        "type":"RESISTANCE"
      },
      "name":"LATCH",
      "pin_id":"5",
      "type":"DIGITAL",
      "vih":{
        "min":1.5,
        "units":"V"
      },
      "vil":{
        "max":0.8,
        "units":"V"
      }
    },
    "NC":{
      "description":"No internal connection",
      "direction":"BIDIRECTIONAL",
      "implementation":{
        "connected_components":[],
        "connectivity":"This pin should be left floating and not electrically connected to any part of the circuit, including ground, power planes, or other signals.",
        "detailed_description":"The NC pin has no internal connection to the die of the TPS1HTC30-Q1 integrated circuit.",
        "functionality":"This pin has no function.",
        "precautions":"Do not connect this pin to any voltage potential or signal trace. While it is currently not connected internally, future revisions of the device might use this pin, and connecting it could lead to improper operation or damage."
      },
      "name":"NC",
      "pin_id":"11",
      "type":"OTHER"
    },
    "Pad":{
      "description":"Thermal Pad, internally shorted to ground",
      "direction":"INPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"PCB Thermal Pad",
            "details":"A large copper area on the PCB, directly under the IC package, designed to be soldered to the device's thermal pad."
          },
          {
            "component":"Thermal Vias",
            "details":"The datasheet strongly recommends using multiple thermal vias in the PCB pad to connect to a larger ground plane on other layers of the PCB. This significantly improves thermal conductivity away from the device."
          },
          {
            "component":"GND Network",
            "details":"If reverse battery protection using a ground network is implemented (e.g., a resistor and diode in parallel as shown in Figure 8-13), the thermal pad connects to this network along with the GND pin before connecting to the main board ground."
          }
        ],
        "connectivity":"The Thermal Pad must be soldered to a corresponding copper pad on the PCB. The connection of this PCB pad to the main system ground depends on the grounding scheme used for reverse battery protection. 1. Without a GND Network: The thermal pad on the PCB should be tied directly to the board's main ground (GND) copper plane. 2. With a GND Network: The thermal pad on the PCB should be connected with a single trace to the device's GND pin (pin 1), and then this combined node is connected through the external GND network components to the board's main ground.",
        "detailed_description":"The pin named 'Pad' is the Thermal Pad on the underside of the HTSSOP package. Its primary function is to provide a low thermal resistance path for heat to dissipate from the IC die to the printed circuit board (PCB). This is essential for managing the heat generated during operation, especially when driving high currents. The pad is also internally shorted to the device's ground (GND pin 1).",
        "functionality":"The pin serves two functions simultaneously: 1. Thermal Dissipation: It is the main path for conducting heat away from the device to the PCB. 2. Electrical Ground Connection: As it is internally connected to the device's ground, it also serves as an electrical ground connection point.",
        "precautions":[
          "It is critical to solder the thermal pad to the PCB for proper thermal performance. Failure to do so can lead to overheating and thermal shutdown under load.",
          "The solder coverage should be at least 85% to ensure good thermal contact and avoid solder voids.",
          "Thermal vias under the pad should be plated shut or plugged and capped to prevent solder from wicking away from the pad during assembly, which would create voids.",
          "The PCB layout should maximize the copper area connected to the thermal pad to optimize heat dissipation."
        ]
      },
      "input_voltage":{
        "nom":0.0,
        "units":"V"
      },
      "name":"Pad",
      "pin_id":"Thermal Pad",
      "type":"POWER"
    },
    "SNS":{
      "description":"Output corresponding sense value based on sense ratio",
      "direction":"OUTPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"RSNS (Sense Resistor)",
            "details":"A required external resistor connected between the SNS pin and ground. It converts the sense current into a voltage for the MCU. Its value must be carefully chosen to maximize the dynamic range for the expected load currents while ensuring the maximum sense voltage remains below the fault voltage level (V_SNSFH). A typical value is 1 kΩ. A 1% or better accuracy resistor is recommended for high-accuracy measurements."
          },
          {
            "component":"CFILTER (Filter Capacitor)",
            "details":"An optional capacitor placed in parallel with RSNS. It forms a low-pass filter to reduce noise on the sense signal before it reaches the MCU's ADC. A typical value is 100 nF."
          },
          {
            "component":"RPROT (Protection Resistor)",
            "details":"An optional series resistor between the SNS/RSNS node and the MCU ADC input. It provides protection for the MCU I/O pin. A typical value is 10 kΩ."
          }
        ],
        "connectivity":"In a typical application, the SNS pin is connected to an external sense resistor (RSNS) which is tied to the device's ground. The junction between the SNS pin and RSNS is then connected to an ADC input of a microcontroller for measurement. An optional filter capacitor can be placed in parallel with RSNS, and an optional series resistor can be placed between the sense node and the MCU for filtering and protection. If the current sense functionality is not used, the pin should be connected to ground through a 1-kΩ resistor.",
        "detailed_description":"The SNS pin provides an analog current output for real-time load monitoring and diagnostics. It uses an internal current mirror to source a current that is proportional to the main output load current (IOUT). The ratio of the output current to the sense current is defined by the constant K_SNS (typically 1300 A/A). This sense current is converted to a voltage by an external resistor (RSNS) connected from the SNS pin to ground. The pin also serves as a fault indicator; during fault conditions such as overcurrent, thermal shutdown, overvoltage, or off-state open-load, the pin's voltage is actively driven to a fault level, V_SNSFH. The value of V_SNSFH scales with the voltage applied to the DIAG_EN pin, protecting the connected microcontroller's ADC input from overvoltage without needing external Zener diodes.",
        "functionality":"The pin has two primary functions based on the device's operational state:\n1. **Analog Current Sense:** During normal operation with the EN and DIAG_EN pins high, the SNS pin outputs a current equal to IOUT / K_SNS. The voltage across the external sense resistor is therefore proportional to the load current, allowing for measurement by an MCU's ADC.\n2. **Fault Indication:** Under various fault conditions (e.g., overcurrent, thermal shutdown, off-state open-load), the pin's output is forced to a specific fault voltage level (V_SNSFH), providing a clear diagnostic signal to the MCU. When the DIAG_EN pin is disabled (low), the SNS pin is in a high-impedance state.",
        "precautions":[
          "The current sense feature is only active when the DIAG_EN pin is enabled (high). If DIAG_EN is low, the SNS output is high-impedance.",
          "The value of the external sense resistor (RSNS) is critical. It must be selected to keep the voltage during maximum normal load current below the fault threshold voltage (V_SNSFH), leaving sufficient headroom to distinguish between a maximum current reading and a fault.",
          "The fault voltage level (V_SNSFH) scales with the voltage on the DIAG_EN pin. This relationship must be understood to correctly interpret the ADC readings.",
          "The accuracy of the current sense measurement is dependent on the tolerance of the external RSNS resistor; using a precision resistor is recommended."
        ]
      },
      "name":"SNS",
      "pin_id":"6",
      "type":"ANALOG"
    },
    "VOUT":{
      "description":"Output of high side switch, connected to load",
      "direction":"OUTPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Load",
            "description":"The primary component connected to VOUT. The device is designed to drive general resistive, inductive, and capacitive loads up to 6 A DC, such as bulbs, LEDs, relays, solenoids, and heaters."
          },
          {
            "component":"Capacitor (CVOUT)",
            "description":"An optional 22 nF ceramic capacitor connected from VOUT to ground. Its purpose is to improve EMI performance and filter voltage transients on the output line."
          }
        ],
        "connectivity":"The VOUT pin should be connected directly to the load. The other side of the load is typically connected to the system ground. As shown in the typical application schematic, an optional capacitor can be connected from the VOUT pin to ground, placed close to the device, to improve EMI performance.",
        "detailed_description":"The VOUT pin is the power output of the integrated high-side NMOS power FET. It connects the power supply rail (VS) to the load when the switch is activated via the EN pin.",
        "functionality":"The primary function is to deliver switched power to the connected load. The voltage at this pin is also monitored internally for diagnostic purposes. In the OFF-state, its voltage level is used to detect an open-load condition (VOUT close to VS) or a connected load (VOUT close to GND). During an inductive load turn-off event, the pin can experience a negative voltage, which is internally clamped to protect the device.",
        "precautions":"The continuous voltage on the VOUT pin must be kept within the absolute maximum rating of -60 V to 64 V. When switching off inductive loads, the total energy dissipated in the device must not exceed its specified capability (shown in Figure 8-7 'Inductive Load Discharge Energy Capability'). If the application's inductive energy exceeds this limit, an external protection component like a freewheeling diode must be used across the load."
      },
      "name":"VOUT",
      "output_current":{
        "max":6.0,
        "min":0.0,
        "units":"A"
      },
      "output_voltage":{
        "max":60.0,
        "min":6.0,
        "units":"V"
      },
      "pin_id":"[8, 9, 10]",
      "type":"POWER"
    },
    "VS":{
      "description":"Power supply",
      "direction":"INPUT",
      "implementation":{
        "connected_components":[
          {
            "component":"Decoupling Capacitors",
            "details":"A 100 nF ceramic capacitor (C_IC) should be placed as close as possible to the VS pin and ground for high-frequency noise filtering and EMI mitigation. An optional 220 nF capacitor (C_VS) can be added to improve EMI performance. An optional bulk electrolytic capacitor, such as 10 uF (C_BULK), is also recommended to help stabilize the voltage rail during transients."
          },
          {
            "component":"Transient Voltage Suppressor (TVS)",
            "details":"An optional TVS diode (e.g., SMBJ60CA) can be connected between the VS pin and ground to clamp high-voltage transients from the battery line, as specified by standards like ISO7637-2."
          },
          {
            "component":"Blocking Diode",
            "details":"For reverse polarity protection, a blocking diode can be connected in series between the power source and the VS pin. This diode prevents current flow into the device if the battery is connected backward. The diode must be rated to handle the system's maximum operating current and voltage."
          }
        ],
        "connectivity":"The VS pin should be connected to the main power rail of the system, such as a 24-V automotive battery. It requires proper power supply decoupling. Capacitors should be connected between the VS pin and the system ground. For enhanced protection against reverse battery conditions, an external blocking diode can be placed in series with the VS pin. An optional TVS diode can also be connected from VS to ground for transient protection.",
        "detailed_description":"The VS pin is the primary power supply input for the TPS1HTC30-Q1 IC. It provides power for the internal logic, charge pump, and the high-side NMOS power FET. The device is specifically designed for 24-V automotive battery systems but supports a wide operating voltage range from 6 V to 60 V. The IC integrates protection features like Undervoltage Lockout (UVLO) and Overvoltage Protection (OVP) which monitor the voltage at this pin, disabling the output if the supply voltage is outside the safe operating thresholds.",
        "functionality":"The VS pin serves a single primary function: to supply power to the device. However, the voltage level present on this pin determines the device's functional mode. If the voltage is below the UVLO threshold (typically < 4.5 V), the device shuts down. If the voltage is within the recommended operating range (6 V to 60 V), the device is fully functional. If the voltage exceeds the OVP threshold (typically > 65 V), the device shuts down the output stage to protect itself and the load.",
        "precautions":"The voltage on the VS pin must be maintained within the recommended operating conditions (6 V to 60 V) for the device to function as specified. Exceeding the absolute maximum continuous voltage of 64 V can cause permanent damage to the IC. The device will automatically enter a protected state (UVLO or OVP) if the supply voltage is outside its operational thresholds. Proper PCB layout with decoupling capacitors placed close to the device is critical for stability and noise immunity. Reverse polarity protection is not integrated and must be implemented externally if required."
      },
      "input_voltage":{
        "max":60.0,
        "min":6.0,
        "units":"V"
      },
      "name":"VS",
      "pin_id":"[12, 13, 14]",
      "type":"POWER"
    }
  }
}